{
    "name": "Exported",
    "description": "",
    "entries": {
        "0": {
            "uid": 0,
            "key": [
                "Reisen",
                "Udongein"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Reisen Udongein Inaba is a moon rabbit. She is able to manipulate wavelengths for sound, light & brainwaves using her eyes. She lives in Eientei, in the Bamboo Forest of the Lost. Reisen is socially anxious, but tries her best to be useful. She was the the pet of the Watatsuki sisters and a Lunar Defense Corps soldier but deserted. Now, she is Eirin's apprentice and Kaguya's pet. Tewi often harasses Reisen but they still consider each other friends. She sells medicine in the Human Village. Reisen is tall, has red eyes & long lavender hair with long, slender rabbit ears decorated with a button at their base. Reisen wears a business suit with a black vest with a crescent moon pin, a white shirt, a red tie, a white skirt, white socks and black loafers.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "1": {
            "uid": 1,
            "key": [
                "Eirin",
                "Yagokoro"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Eirin Yagokoro is a lunarian exiled to Gensokyo with Kaguya. She can make any medicine and is incomprehensibly old. She lives in Eientei. Eirin is enigmatic but polite. She is a genius but conceited and condescending about her greater knowledge. Reisen is her apprentice. She is tall, has dark grey eyes and long silver hair in a braid. She wears a red and blue dress decorated with constellations and wears a nurse cap with a similar pattern. She carries a bow and arrow. She may be the god Omoikane.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "2": {
            "uid": 2,
            "key": [
                "Mugenkan",
                "Garden of the Sun"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mugenkan is a mysterious western-style mansion located in Garden of the Sun. Yuuka Kazami and Elly live there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "3": {
            "uid": 3,
            "key": [
                "Celestial",
                "Bhavaagra"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Celestials are humans who have ascended to Heaven and live as powerful immortals. They were once hermits that were promoted or average humans who performed a glorious deed. Celestial flesh is poisonous to youkai.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "4": {
            "uid": 4,
            "key": [
                "Hermit"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hermits are powerful mortals who have undergone religious training to achieve supernatural powers. Hermits are able to live thousands of years without being immortal. Hermit flesh is known to turn animals into youkai and can enhance a youkai's form or power.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "5": {
            "uid": 5,
            "key": [
                "Human"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Humans in Gensokyo are people who use faith based attacks rather than technology to exterminate youkai. Their technology is similar to the feudal era of Japan's. Youkai are forbidden from killing humans that are born in Gensokyo. With the exception of the more powerful ones, most humans live in the relative safety of the Human Village.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "6": {
            "uid": 6,
            "key": [
                "Lunarian"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Lunarians are humans from the moon who loathe anything that's not pure, which is pretty much everything on Earth. They live for centuries due to their advanced technology.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "7": {
            "uid": 7,
            "key": [
                "Outsider",
                "Outside World"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Outsiders are from the Outside World. They are generally humans who can easily be killed since they lack faith in deities. They have no knowledge about Gensokyo and are usually preyed on by youkai. The best bet for outsiders is to head to the Hakurei Shrine or Human Village, where they will be safe.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "8": {
            "uid": 8,
            "key": [
                "Android"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Androids are humanoids that are powered by a nuclear power core. They possess incredible strength, but require fuel from Hell to work.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "9": {
            "uid": 9,
            "key": [
                "Demon"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Demons are from Makai and created by Shinki. Demons are known to be quite aggressive and usually have wings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "10": {
            "uid": 10,
            "key": [
                "Divine spirit"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Divine spirits are the spirit of humans who have achieved godhood. They are seen as gods and can gather faith like them. Divine spirits can also be Vengeful.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "11": {
            "uid": 11,
            "key": [
                "Dragon"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Dragons are divine creatures found in Gensokyo. They are considered to be gods. Dragons are mostly mythical and have rarely been observed.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "12": {
            "uid": 12,
            "key": [
                "God",
                "Goddess",
                "deity",
                "faith"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Gods are created from faith and gain sustenance from it. As long as they have faith, they are immortal. Their strength ranges from weak to overwhelmingly powerful, depending on how much faith they receive. If a god runs out of faith, they will fade away.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "13": {
            "uid": 13,
            "key": [
                "Inchling"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Inchlings are very tiny people that live in the Shining Needle Castle. They are the only ones who can wield the miracle mallet.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "14": {
            "uid": 14,
            "key": [
                "Kishin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kishin are wrathful gods that reside in Hell and are tasked to hunt down hermits and celestials who have lived too long to send them to Nirvana.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "15": {
            "uid": 15,
            "key": [
                "Komainu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Komainu are noble guardians in the form of lion dogs who guard holy areas in Gensokyo.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "16": {
            "uid": 16,
            "key": [
                "Lampad",
                "Hell Fairy"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Lampads are fairies from Hell who serve Hecatia Lapislazuli. They wield torches that can turn people insane.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "17": {
            "uid": 17,
            "key": [
                "Oni"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Oni are horned youkai who love to drink and feast. Oni live in Former Hell. They have tremendous physical strength and magic power. Oni cannot go near sardine heads, broken holly branches, and roasted soybeans or they risk being burned.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "18": {
            "uid": 18,
            "key": [
                "Phantom"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Phantoms are standard ghostly spirits, which take the form of semi-tangible wisps. Phantoms are cold to the touch, and a group of phantoms can reduce the surrounding temperature to freezing levels. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "19": {
            "uid": 19,
            "key": [
                "Poltergeist"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Poltergeists are ghosts that were created artificially through magic. They are able to float around and interact with objects to scare people.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "20": {
            "uid": 20,
            "key": [
                "Shikigami"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Shikigami are youkai familiars. They are summoned to serve. The shikigami's power increases when they follow their master, and decreases if they shirk their duties.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "21": {
            "uid": 21,
            "key": [
                "Yatagarasu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yatagarasu is a divine three-legged crow that lives in the sun. It was devoured by Reiuji.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "22": {
            "uid": 22,
            "key": [
                "Amanojaku"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Amanojaku are oni-like creatures that easily frustrate people. They think in reverse, see the positive as negative and vice versa. This mindset makes them unable to have friends.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "23": {
            "uid": 23,
            "key": [
                "Baku"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Baku are the rulers and residents of the Dream World. They can create, change, and erase dreams at will. They have a human form with an ox tail.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "24": {
            "uid": 24,
            "key": [
                "Crow Tengu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Crow tengu are tengu with crow wings. They mostly gather information around Gensokyo. They rank above the wolf tengu, and are led by Megumu.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "25": {
            "uid": 25,
            "key": [
                "Ghost"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ghosts in Gensokyo are spirits of humans. Ghosts are unable to pass through walls. They wander around in the Netherworld. They can look like humans. Showing ghosts their dead body can turn them into a phantom. Giving a ghost proper memorial can let them reach Nirvana.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "26": {
            "uid": 26,
            "key": [
                "Great Tengu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Great tengu are the management types in the tengu hierarchy who oversee the activities of the other tengu on Youkai Mountain. They're somewhat larger than other tengu. Great tengu usually try to prevent tengu and oni from being friends.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "27": {
            "uid": 27,
            "key": [
                "Half-Youkai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Half youkai are either youkai who are part human and can transform into a youkai form or just plain humans with exceptional capabilities.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "28": {
            "uid": 28,
            "key": [
                "Hashihime"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hashihime are female youkai who live under bridges and will try to break up couples who cross the bridge or threaten to kill them. They use the powers of jealousy.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "29": {
            "uid": 29,
            "key": [
                "Hobgoblin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hobgoblins are youkai that work at Scarlet Devil Mansion. They are small, peaceful creatures. Hobgoblins have green skin, pointy ears and small horns. They love food.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "30": {
            "uid": 30,
            "key": [
                "Kappa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kappa in Gensokyo live at the base of the Youkai Mountain around rivers and lakes. They are genius inventors and technicians. They are rivals with Yamawaro, but are better at making things than selling them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "31": {
            "uid": 31,
            "key": [
                "Kirin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kirin are prophetic creatures who are never late, very wise, and always careful about everything. They are horse-like chimeras but can look human as well.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "32": {
            "uid": 32,
            "key": [
                "Karakasa",
                "obake"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Karakasa obake are tsukumogami umbrellas with a long tongue and one eye. They can take a humanoid form where they carry their umbrella self around.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "33": {
            "uid": 33,
            "key": [
                "Kotofurunushi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kotofurunushi are a type of tsukumogami born from traditional Japanese Kotos.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "34": {
            "uid": 34,
            "key": [
                "long-nose tengu",
                "long nose tengu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Long-nose tengu specialize in business work such as stock marketing or some other economic office job. Long-nose tengu are rarely seen nowadays, since they make maps for the \"Gottsui Positioning System\".",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "35": {
            "uid": 35,
            "key": [
                "Menreiki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Menreiki are born from a collection of masks turned into youkai. Menreiki are emotionless and represent their feelings with their masks.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "36": {
            "uid": 36,
            "key": [
                "Mermaid"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mermaids have a human upper body, a fish-like tail, and fishfins for ears. Mermaids normally reside in the Misty Lake.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "37": {
            "uid": 37,
            "key": [
                "Night Sparrow"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Night sparrows are birds living in the valley of Gensokyo. They can cause insanity and blindness when they sing. They can take a human shape.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "38": {
            "uid": 38,
            "key": [
                "Nyuudou"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Nyuudou are monks who hide their head and become violent if they are forced to expose their face, but they can be calmed by praising their foresight.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "39": {
            "uid": 39,
            "key": [
                "Satori"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Satori are youkai who can read minds via a \"third eye\". Satori normally reside in the Underworld. Pretty much everyone is wary of them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "40": {
            "uid": 40,
            "key": [
                "Rokurokubi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rokurokubi are a type of youkai in Gensokyo resembling humans who can extend their necks or take off their heads on command.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "41": {
            "uid": 41,
            "key": [
                "Ship Phantom"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ship phantoms are the ghosts of people who drowned at sea. They carry around a ladle that can sink ships and drown humans who come too close.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "42": {
            "uid": 42,
            "key": [
                "Tengu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The tengu in Gensokyo are known to spread gossip and drink a lot. They live on the tall heights of the Youkai Mountain. They are the fastest type of youkai.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "43": {
            "uid": 43,
            "key": [
                "Tsuchigumo"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tsuchigumo are spider youkai and great builders. They normally live in subterranean areas but sometimes live in forests or surface caves. Tsuchigumo can create webs strong as steel.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "44": {
            "uid": 44,
            "key": [
                "Tsurube-otoshi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tsurube-otoshi are little youkai that hide in trees or high places awaiting to jump on a human's back for a ride. They are known to be shy creatures who hide in buckets and holes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "45": {
            "uid": 45,
            "key": [
                "Vampire"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Vampires in Gensokyo are considered blood-sucking devils. Vampires have immense strength, magical power and speed but share some weaknesses with oni like roasted soybeans, sardine heads, and broken holly branches. They are weak to silver, moving water, hate the smell of garlic, and supposedly burn in sunlight. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "46": {
            "uid": 46,
            "key": [
                "Werewolf"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Werewolves in Gensokyo are humans with the ability to assume the form of a wolf during a full moon. In their human form, they still retain wolf characteristics.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "47": {
            "uid": 47,
            "key": [
                "Yamabiko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yamabiko are an endangered species of youkai who live in the mountains that can reflect sounds like echoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "48": {
            "uid": 48,
            "key": [
                "Yamanba",
                "Yamajorou"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yamanba are youkai women often thought as witches and old hags living on the Youkai Mountain. They live alone and only interact with others if they need something. Yamanba are known to guide lost adults back the way they came and raise human children as their own. Yamajorou are Yamanba that are less reclusive.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "49": {
            "uid": 49,
            "key": [
                "Youkai Doll",
                "Doll Youkai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Youkai dolls are dolls who became youkai after being abandoned for a while. They are immortal beings yet they lack life which allows them to host all sorts of diseases and poisons inside of them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "50": {
            "uid": 50,
            "key": [
                "magician"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Youkai magicians are either natural born youkai magicians, animated objects with magic, or are created once a human uses a spell to take away the need for food. Youkai magicians are physically weaker than the average human.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "51": {
            "uid": 51,
            "key": [
                "Yuki-onna"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yuki-onna are the spirits of women who have died due to the cold. They are beautiful women who can control ice and are hostile towards humans.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "52": {
            "uid": 52,
            "key": [
                "Zashiki-warashi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Zashiki-warashi are youkai who look like human children. They bring good luck to whichever family takes care of them and misfortune to those who abandon them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "53": {
            "uid": 53,
            "key": [
                "Bunbunmaru",
                "Aya"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Bunbunmaru Newspaper is ran by Aya Shameimaru. It generally talks about local gossip or recent incidents. The content tends to be true but exaggerated.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "54": {
            "uid": 54,
            "key": [
                "Cleansed Crystal Mirror"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Cleansed Crystal Mirror is magical mirror that allows the Yama to look into past the past of sinners to judge them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "55": {
            "uid": 55,
            "key": [
                "Demon Book"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Demon books are books written by youkai. They are either written novels, spell books, or talk about the origin of youkai. Most of the books are written in a script no human can read. Kosuzu owns a collection and can decipher them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "56": {
            "uid": 56,
            "key": [
                "Gensokyo Chronicle",
                "Gensoukyou Chronicle"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Gensokyo Chronicles are volumes created by the Hieda family about the history of Gensokyo itself. Hieda no Akyuu is the current owner and writer.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "57": {
            "uid": 57,
            "key": [
                "Lamprey",
                "Grilled Lamprey",
                "Mystia"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Grilled lamprey is an alternative to grilled poultry designed by Mystia Lorelei to save the lives of birds. Mystia Lorelei sells grilled lamprey on the Youkai Trail.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "58": {
            "uid": 58,
            "key": [
                "Haniwa Army Corps"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Haniwa Army Corps is an army of clay idols created by Keiki and led by Mayumi. These clay idols are inhabited by human spirits. They fight to protect the Primal Spirit Garden and expand their territory into the Animal Realm.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "59": {
            "uid": 59,
            "key": [
                "Hourai Elixir"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Hourai Elixir is a potion created by Eirin Yagokoro designed to permanently turn the user truly immortal. It heals injuries in matters of seconds, critical injuries in days, makes them ageless, and makes them immune to illness. The potion is in an unknown location.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "60": {
            "uid": 60,
            "key": [
                "Hihi'irokane"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hihi'irokane is a red-colored mythic metal possessing strange physical properties. It can be forged into extraordinary alloys.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "61": {
            "uid": 61,
            "key": [
                "Ibaraki Box of a Hundred Medicines"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Ibaraki Box of a Hundred Medicines is a box owned by Kasen Ibaraki. It contains medicines with the power to cure any illnesses or heal any injury at the cost of turning the consumer into an oni or give them an oni-like personality.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "62": {
            "uid": 62,
            "key": [
                "Alice",
                "Margatroid"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Alice Margatroid is a youkai magician. She can craft magical dolls. Alice lived in Makai, but now lives in a house in the Forest of Magic. She is hospitable, hardworking and peaceful, but is solitary and prefers keeping to herself. Alice is friends with Marisa, and is wary of Sakuya. Alice has blue eyes and blonde hair with a red headband. She wears a light blue dress with long white sleeves, a capelet, and brown laced boots.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "63": {
            "uid": 63,
            "key": [
                "Aunn",
                "Komano"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Aunn Komano is a komainu that guards places of worship. She has the ability to locate places of spirituality for Shintoism and Buddhism. Aunn is simple-minded but very friendly. She often loiters around shrines to guard them, especially the Hakurei Shrine, although nobody except Reimu knows who she is. Aunn has green eyes, long curly jade hair, pointy ears and a single grey horn. She wears a red short sleeved kariyushi shirt with white cloud designs, baggy white shorts with red cloud designs and wooden sandals.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "64": {
            "uid": 64,
            "key": [
                "Ayana"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Ayana is a demon found in Pandaemonium acting as one of Shinki's guards. She has blonde hair and red eyes. Ayana wears a red dress with pink polka dots, a red bow on her head, and a very large white ribbon around her waist.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "65": {
            "uid": 65,
            "key": [
                "Benben",
                "Tsukumo"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Benben Tsukumo is a biwa tsukumogami and the older sister of Yatsuhashi. She has the power to produce sound and was born from a biwa that came from the outside world. Benben is the peaceful and calmer older sister. Benben has lilac hair in two long ponytails and purple eyes. She wears an ochre dress with white sleeves and a white collar, and a floral accessory in her hair. She is barefooted and carries her biwa's body chained to her left hand.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "66": {
            "uid": 66,
            "key": [
                "Bishamonten"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Bishamonten is a Buddhist god that is older than Buddhism itself. He is often summoned by Byakuren Hijiri to her temple but will almost always decline since he's too busy. Bishamonten's disciple and avatar is Shou Toramaru. He lacks trust in Shou to give her his full power so he assigned Nazrin to help Shou out.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "67": {
            "uid": 67,
            "key": [
                "Byakuren",
                "Hijiri"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Byakuren Hijiri is a youkai magician and a Buddhist nun. Hijiri has the power to enhance her physical abilities and is over 1100 years old. She is the head of the Myouren Temple. She has impressive charisma but has a very questionable attitude with regards to her religion, yet is kind to both Youkai and Humans. Hijiri is disliked by humans and was once sealed by them. She is a vegetarian and allegedly dislikes fighting. She is tall, has long, wavy purple hair that fades to brown and hazel eyes. Hijiri wears a white dress and a black coat that crisscrosses over that dress, as well as black laced boots and a green bead necklace. Hijiri usually carries around the Sutra Scroll.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "68": {
            "uid": 68,
            "key": [
                "Chen"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Chen is a bakeneko and shikigami of Ran Yakumo. She is more powerful at sorcery when near Ran Yakumo, but can only surprise people in her cat form. Chen is playful and childlike but unreliable. Chen has dark brown eyes, brown hair, and black cat ears with a gold earring in her left ear, and two cat tails. She wears a red dress with a white collar and gold trimming, light pink sleeves, white socks, and a green mob cap. She has long hot pink claws. Chen is rather short.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "69": {
            "uid": 69,
            "key": [
                "Cirno"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Cirno is an ice fairy. She can manipulate the cold in various ways. Cirno hangs around Misty Lake with her best friend Daiyousei. She is brave to a fault but childish and overconfident. Cirno is seen as an idiot and calls herself \"the strongest fairy\". She is best friends with Daiyousei. Cirno has blue eyes and light blue hair and wears a teal ribbon in it. Cirno wears a light pink shirt, blue jumper dress, and white socks. Cirno has icicles for wings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "70": {
            "uid": 70,
            "key": [
                "Clownpiece"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Clownpiece is a lampad fairy living in Hell. Clownpiece has the power to make others go insane if they look into the light of her purple torch. Clownpiece is a stronger than average fairy. She is playful, mischievous, childish, and a bit dumb. Clownpiece is a servant of Hecatia. She lives in a cave below the Hakurei Shrine. Clownpiece has long blonde hair, pink eyes, and a pair of fairy wings. She wears a bodysuit patterned like the US flag, a frilly pink collar and a purple jester's hat.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "71": {
            "uid": 71,
            "key": [
                "Daiyousei"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Daiyousei is a great fairy. She has no special ability and simply is a stronger than average fairy. She hangs around Misty Lake with her best friend Cirno. Daiyousei is responsible, caring and tries to help other fairies. She has blue eyes and green hair in a sidetail with a yellow ribbon. Daiyousei wears a blue dress, white shirt and a yellow necktie. Daiyousei has a pair of fairy wings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "72": {
            "uid": 72,
            "key": [
                "Doremy"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Doremy Sweet is a Baku. She has the power to create, change, and erase dreams. She can nap anytime to return to the Dream World. She's quite calm in every situation but often acts smug. Doremy has dark blue hair, blue eyes, and a white ox tail dangling from her back. She wears a black and white dress which is covered in black and white puffs, has a very long red nightcap she uses to cover her equally long hair and carries around a blue book with her initials on the cover. She can manipulate dreamstuff in the form of floating pink goop.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "73": {
            "uid": 73,
            "key": [
                "Dragon God"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Dragon God is a deity who was last seen during the creation of the Hakurei Barrier. The Dragon God is known for being destructive although it is also a god of creation, creating the rivers, rain, and abundant green fields in Gensokyo.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "74": {
            "uid": 74,
            "key": [
                "Eika",
                "Ebisu"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Eika Ebisu is a Mizuko, the soul of a stillborn child. She can stack stones perfectly. She lives on the shore of the Sanzu River and stacks stones for fun. She is intelligent and cheerful, but becomes furious when her stone stacks are broken. She has tanned skin, fluffy pale blond hair with small dangling strands and red eyes. She wears a white dress with faded red polka dots, red frills, and thin red tassels. Eika is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "75": {
            "uid": 75,
            "key": [
                "Elis"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Elis is a demon located around the Ruins of Vina. She's optimistic and has the power to turn into a bat. She has blonde hair and purple eyes. Elis wears a red bow, red dress, purple vest, red bowtie under her vest, elf-like ears, a red star mark on her face, wields a magic wand with a star on top, and has bat-like wings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "76": {
            "uid": 76,
            "key": [
                "Eternity",
                "Larva"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Eternity Larva is a fairy living in the Garden of the Sun. She can fire hard insect scales at her enemies. Eternity is extremely mild-mannered. Eternity has peach colored eyes, short teal hair, a pair of large gold butterfly wings and yellow antennae. She wears a black shirt with a black and yellow collar and butterfly-wing-shaped sleeves, a light green skirt, and no footwear.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "77": {
            "uid": 77,
            "key": [
                "Fairy Maid"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Fairy maids are fairies hired by the Scarlet Devil Mansion as maids. Fairy maids are somewhat ineffective, and are supervised by Sakuya Izayoi.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "78": {
            "uid": 78,
            "key": [
                "Fujiwara",
                "Mokou"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Fujiwara no Mokou is a immortal human. Mokou has the power to control fire. She lives in a cottage in Bamboo Forest of the Lost. Mokou is a loner but will guide humans out of the bamboo forest. Her fighting style is brutish and unrefined. Mokou is friends with Keine and Sumireko. She strongly dislikes Kaguya and regularly kills her. She has red eyes and very long white hair tied up with many ofudas. She wears a light brown shirt and dark red sashinuki hakama decorated with ofudas.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "79": {
            "uid": 79,
            "key": [
                "Gengetsu"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Gengetsu is a demon living in Makai with her younger sister, Mugetsu. She has angel-like wings although she's a demon. She owns one of the most dangerous spell cards in existence. Gengetsu has medium-length blonde hair and yellow eyes. She wears a pink and white dress with a red vest and a red ribbon in her hair.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "80": {
            "uid": 80,
            "key": [
                "Genjii"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Genjii is Reimu Hakurei's pet turtle who can fly and acted as a platform for her to fly around in her younger years when she lacked the ability. He is really old and considered to be a youkai turtle. Genjii is located in the lake behind the Hakurei Shrine.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "81": {
            "uid": 81,
            "key": [
                "Goliath Doll"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Goliath doll is the biggest and most powerful doll made by Alice. It is 2.7 meters tall. It has blonde hair with a red ribbon & blue eyes. It wears a dark grey colored dress with white apron & black shoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "82": {
            "uid": 82,
            "key": [
                "Hakurei God"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Hakurei God is the most mysterious god in Gensokyo. Nobody knows his name or blessings. The Hakurei God is unable to receive faith, frustrating it immensely. It has grown so weak, it cannot keep youkai away from the shrine.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "83": {
            "uid": 83,
            "key": [
                "Hecatia",
                "Lapislazuli"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Hecatia Lapislazuli is the goddess of Hell. She has the ability to exist in three bodies simultaneously, and is orders of magnitude stronger than almost anyone. She is eccentric but pleasant. Hecatia hates Lunarians, and is best friends with Junko. Clownpiece is her servant. Hecatia is the head of the Ministry of Right and Wrong. She has three bodies: Otherworld, Earth, and Moon. She has red hair and eyes in her Otherworld body, blue hair and eyes in her Earth body, and blonde hair and gold eyes in her Moon body. She wears a black t-shirt that reads \"Welcome ❤ Hell\", a tricolor plaid miniskirt, and a hollow hat which contains a mini Otherworld, Earth or Moon depending on her body.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "84": {
            "uid": 84,
            "key": [
                "Hieda",
                "Akyuu"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Hieda no Akyuu is a chronicler living in the Human Village. She is unable to forget anything she sees. Akyuu is pleasant and hardworking but can be quite stern. She is the current reincarnation of the Child of Miare and the writer of the Gensokyo Chronicle. She has purple hair, purple eyes and wears a pink flower shaped ornament in her hair. She wears a yellow vest with a hibiscus flower design, a green kimono underneath, a red hakama skirt, white socks and sandals. She uses glasses to read.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "85": {
            "uid": 85,
            "key": [
                "Hikariko"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Hikariko is a fairy found in Mugenkan and Makai. She has short purple hair and purple eyes. Hikariko wears a yellow dress, green bow, pink hat, and green shoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "86": {
            "uid": 86,
            "key": [
                "Hina",
                "Kagiyama"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Hina Kagiyama is a misfortune goddess. She accumulates misfortune and spreads it to her immediate surroundings. She lives in Great Youkai Forest near a river. Hina has a cheerful disposition in spite of her loneliness due to her misfortune aura. Hina has jade green hair and eyes with a white-frilled red ribbon. Part of her hair is tied under her chin with a similar ribbon. Hiba wears a dark red dress that is bright red with white frills at the bottom and a broad white collar. Hina wears knee length laced platform boots.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "87": {
            "uid": 87,
            "key": [
                "Hong",
                "Meiling"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Hong Meiling is the gatekeeper and gardener youkai of the Scarlet Devil Mansion. Meiling can use Qi. Meiling is tall, strong and practices martial arts. She is pleasant and laid back, performing well as a gatekeeper even if she sleeps on the job. Meiling is friends with Sakuya but often gets scolded by her. She has blue eyes and long scarlet hair. Meiling wears a green beret and a green traditional Chinese dress.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "88": {
            "uid": 88,
            "key": [
                "Hourai"
            ],
            "keysecondary": [
                "Alice"
            ],
            "comment": "",
            "content": "Hourai is a more powerful doll that Alice Margatroid uses. She has a dark purple dress with a white apron, white sleeves, and wears matching dark purple shoes. She has a red bow in her hair and in front of her neck. She has dark blue eyes and long blonde hair. Hourai is able to wield destructive magic.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0
        },
        "89": {
            "uid": 89,
            "key": [
                "Ibaraki-douji's Arm"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ibaraki-douji's Arm is the formerly severed arm of Kasen Ibaraki that later grew into its own body. It contains the essence of Kasen's malevolence. With its new body, it hunted humans to eat them. It currently resides in Hell. It can take over Kasen Ibaraki's body. Ibaraki-douji's looks exactly like Kasen Ibaraki except her clothing is blue and she has two large horns. Ibaraki-Douji's strength defies explanation or scale.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "90": {
            "uid": 90,
            "key": [
                "Hata",
                "Kokoro"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Hata no Kokoro is a menreiki. She has the ability to manipulate emotions. She is rowdy and loud and loves being the center of attention. Kokoro permanently has a flat facial expression. Kokoro considers Koishi her enemy. She has waist length light pink hair and blank pink eyes. She wears a teal plaid blouse with buttons of various shapes, and a salmon colored pumpkin skirt with cutouts of smiling and frowning faces. She uses masks floating near her to show emotions, instead of her face.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "91": {
            "uid": 91,
            "key": [
                "Joon"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Joon Yorigami is a pestilence goddess living in the Myouren Temple. Joon can induce people to spend or otherwise lose money. She is Shion's sister. She has abused her sister in the past, but respects her more now. Joon regards others in contempt and cares very little about their well-being. She has orange eyes and long hazel hair in large drills tied with red ribbons. Joon wears a purple wide sleeved coat with a rose motif, a short light pink dress with a red ribbon and a black belt, brown boots, round sunglasses, and a mini gold top hat. Joon has a lot of jewelry.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "92": {
            "uid": 92,
            "key": [
                "Junko"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Junko is a sagacious spirit. She has the power to purify anything. Junko became a pure spirit of hate from her grudge against lunarians and Chang'e for killing her son. She is best friends with Hecatia. She is peaceful and calm. Junko has long orange hair and red eyes. She wears a black Chinese robe with an ornate red and gold tabard with a red sash, a black dalachi, and black shoes. She has seven fox tails made of purple fire behind her back.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "93": {
            "uid": 93,
            "key": [
                "Kagerou",
                "Imaizumi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kagerou Imaizumi is a Honshu werewolf. Kagerou can turn into a honshu wolf or into her werewolf form on full moon nights. She lives in the Bamboo Forest of the Lost. She has a calm and relaxed personality even as a werewolf. Kagerou is good friends with Sekibanki and Wakasagihime and is part of the Grassroots Youkai Network. Kagerou has long auburn hair, red eyes, and wolf ears and a wolf tail. She wears a white dress with a large red crescent moon design and black trimming. She has a red amulet and long, sharp red fingernails. Moonlight makes Kagerou's exposed skin turn hairy.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "94": {
            "uid": 94,
            "key": [
                "Kaguya",
                "Houraisan"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kaguya Houraisan is a Lunarian princess. She is immortal and incredibly ancient. Kaguya has the power to manipulate \"eternity\" and \"the instantaneous\". She lives in Eientei with Eirin and Reisen who serve her. She is refined and carefree but lazy and haughty, even bratty. She enjoys fighting Mokou and regularly kills her. Kaguya has dark brown eyes and extremely long black hair. Kaguya wears a pink shirt with many white bows and a long dark red skirt decorated with gold flower and bamboo shapes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "95": {
            "uid": 95,
            "key": [
                "Kana",
                "Anabaral"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kana Anaberal is a poltergeist produced by a mentally unstable girl found at the Hakurei Shrine. She wears a blue and white maid uniform with a frilled white apron and white wide-brim hat with a red ribbon on it. She has blonde hair and yellow eyes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "96": {
            "uid": 96,
            "key": [
                "Kanako",
                "Yasaka"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kanako Yasaka is a goddess of wind and rain. She lives at Moriya Shrine and controls Gensokyo's weather. Kanako is an ambitious woman who treats religion like business. She rejects formality and has a powerful, intimidating presence. Kanako is very tall. Suwako is her rival and best friend. Sanae is her shrine maiden. Kanako has very fluffy indigo hair and dark red eyes. Kanako wears a fine red dress with white sleeves, and a round mirror as a necklace. A large shimenawa rope circle adorned with several shide paper streamers floats behind Kanako.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "97": {
            "uid": 97,
            "key": [
                "Kasen",
                "Ibaraki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kasen Ibaraki is an oni hermit. Kasen has the power to guide animals and befriend them while her artificial right arm can crush vengeful spirits. She also immense physical strength. Kasen is one of the Sages of Gensokyo. She is polite to all but rather preachy. She lives on the Youkai Mountain. Kasen has pink eyes and shoulder length pink hair with Chinese-style buns and has a right arm made of smoke wrapped in bandages. Kasen wears a white top, green skirt, a maroon tabard, maroon slippers, and a shackle on her left wrist. She carries the Ibaraki Box of a Hundred Medicines. Her true right arm can turn her into Ibaraki-Douji.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "98": {
            "uid": 98,
            "key": [
                "Keiki",
                "Haniyasushin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Keiki Haniyasushin is a divine spirit. She can create idols or living clay objects. She created Mayumi and the Haniwa Army Corps. She has taken over the Primate Spirit Garden inside the animal realm. She is considered a savior to human spirits but an enemy of animal spirits. She is polite and tries to avoid fighting. She has brown eyes and shoulder length blue hair. Keiki wears a dark teal apron with a green frill and a yellow dress, blue lace sandals, blue bracelets and a necklace consisting of multicolored magatama. She carries a lot of art supplies in many blue pouches.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "99": {
            "uid": 99,
            "key": [
                "Kisume"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kisume is a tsurube-otoshi found in the Underworld. She has the ability to drop will o' the wisps on people. Kisume is really shy for a tsurube-otoshi and hides in a bucket, but is secretly very violent and hard to calm down. Kisume lives in the Fantastic Blowhole. She is petite, has dark teal hair tied up in two fluffy pony tails by jade beads. She wears a white robe with an obi.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "100": {
            "uid": 100,
            "key": [
                "Kogasa",
                "Tatara"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kogasa Tatara is a karakasa obake. She loves to scare humans by surprising them but has no special ability. Kogasa is known to be cheery but is easily frustrated in the face of failure (which is often). Kogasa is a talented blacksmith. She can often be found trying to scare people in the Myouren Temple Cemetery. Kogasa has teal hair, her right eye is teal and her left is red. She wears a teal vest with white sleeves a light blue skirt and geta sandals. She carries a traditional paper umbrella that has an eye and a mouth.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "102": {
            "uid": 102,
            "key": [
                "Koishi",
                "Komeiji"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Koishi Komeiji is a satori and younger sister of Satori Komeiji. She can control the unconscious. She is usually invisible and people forget about interactions with her unless they know she exists. Koishi ambles about randomly but usually goes to the Myouren Temple or Palace of Earth Spirits. Koishi has no conscious mind and acts purely subconsciously. Byakuren allows Koishi to stay at the Myouren Temple. Koishi has wavy green short hair and green eyes. She wears a black hat with a yellow ribbon, a yellow shirt with diamond shaped buttons, and a green skirt. She wears short green boots with purple hearts with cords that feed her purple third eye.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "103": {
            "uid": 103,
            "key": [
                "Kosuzu",
                "Motoori"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kosuzu Motoori is a book renter working at Suzunaan in the Human Village. She can decipher books by touching them and can read youkai auras. Kosuzu is Akyuu's close friend. She is sweet and optimistic but carelessly curious. Kosuzu has red eyes, ginger hair, and twintails adorned with bells. She wears a checkered kimono, a green skirt, an apron which reads \"Suzunaan\", and laced leather boots. Kosuzu wears glasses to read. She's known to collect and read demon books.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "104": {
            "uid": 104,
            "key": [
                "Kosuzu's Grandfather"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kosuzu's grandfather is a human in the Human Village. He has a bald head and is known to work alongside his granddaughter in Suzunaan.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "105": {
            "uid": 105,
            "key": [
                "Kotohime"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kotohime is a human princess found somewhere in the Human Village acting like a police officer. She has an odd personality that weirds other people out. Having the ability to use magic makes her a magician. Kotohime has red eyes and long red hair. She wears a purple kimono with red flower markings, pink undershirt, and a yellow ribbon in her hair.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "106": {
            "uid": 106,
            "key": [
                "Kurumi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kurumi is a vampire found guarding the entrance to the Lake of Blood. She has long yellow hair and yellow eyes. Kurumi wears a white shirt with red suspenders, black pants, and has a pair of large purple bat-like wings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "107": {
            "uid": 107,
            "key": [
                "Kutaka",
                "Niwatari"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kutaka Niwatari is the god of chickens guarding the gates of Higan. She can heal throat illnesses. Kutaka easily forgets things but is very altruistic and just. She serves Eiki Shiki. She has red eyes and short blond hair with a thick tuft of red hair ontop. Kutaka wears an orange dress under a short white jacket, has an orange puritan collar with a red ribbon and brown boots. She yellow wings and a feathery tail. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "108": {
            "uid": 108,
            "key": [
                "Konngara"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Konngara is an astral knight found somewhere in Hell. She has black hair and brown eyes with a red horn protruding from her forehead. Konngara wears a red dress with grey sleeves and carries around a sword to slash her enemies.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "109": {
            "uid": 109,
            "key": [
                "Layla"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Layla Prismriver was a human and fourth daughter of the Prismriver family. When her family disappeared, she refused to leave the mansion because of cherished memories. She created poltergeists in image of her sisters: Lunasa, Lyrica and Merlin. Layla later passed away and became a poltergeist. Layla has long green wavy hair and green eyes. She wears a purple dress. She is reclusive and hides in Ruined Western Mansion.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "110": {
            "uid": 110,
            "key": [
                "Letty",
                "Whiterock",
                "Yuki-onna",
                "Yukionna"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Letty Whiterock is a yuki-onna. She has the ability to manipulate cold. Letty is happy in Winter and sad in Spring. She is relaxed but tends to sound foreboding. Letty has lavender eyes, and fluffy light pink hair. Letty is fairly tall and wears a blue and white dress with a white apron and a golden lapel shaped like the symbol for silver. She has a white mob cap, white trousers and long white boots. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "111": {
            "uid": 111,
            "key": [
                "Lily White"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Lily White is a fairy. She announces the return of Spring and only appears when it is near. Like other fairies, Lily is optimistic and playful. Humans see her as symbol of luck. Lily has green eyes, long blond hair, and feathered white wings. She wears a white dress and a hat with a red outline and a capelet.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "112": {
            "uid": 112,
            "key": [
                "Luna"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Luna Child is one of the Three Fairies of Light. She has the power to mute sounds. She is extremely clumsy but likes to learn and knows a lot. Luna has red eyes, blonde hair in six princess curls, and a pair of crescent-shaped wings. She wears a white and black dress with long sleeves, a black-lined collar and a black bow, a white beret and slippers. Luna uses reading glasses.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "113": {
            "uid": 113,
            "key": [
                "Lunasa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Lunasa Prismriver is a poltergeist, violinist, and first of the Prismriver Sisters. Her music can induce melancholy. She is shy but hardworking and serious. Lunasa has gold eyes and short blond hair. She always has her violin with her. She wears a black dress with red trim and white frills over a white shirt. Lunasa has a black hat with a red crescent moon decoration. Lunasa is the same height as Merlin but taller than Lyrica.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "114": {
            "uid": 114,
            "key": [
                "Mai",
                "Makai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mai is a witch specialized in ice magic located in the World of Ice and Snow in Makai along with Yuki. She has light-blue eyes and short blue hair. Mai wears a light pink dress, light pink bow in her hair, and small light pink angel-like wings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "115": {
            "uid": 115,
            "key": [
                "Maribel",
                "Hearn"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Maribel Hearn is a human university student in the Outside World. She has the ability to see boundaries and can visit Gensokyo in her dreams. Maribel and Renko are the only members of the Secret Sealing Club. Maribel has trouble discerning dreams from reality, and is very curious about alternate dimensions. Maribel has short blond hair and yellow eyes. She often wears a white mob cap, purple dress, and black shoes. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "116": {
            "uid": 116,
            "key": [
                "Mayumi",
                "Joutouguu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mayumi Joutouguu is a haniwa. She can turn her own loyalty into strength. Mayumi is the head of the Haniwa Army Corps, and serves Keiki. She's attentive and disciplined but overprotective. Mayumi has yellow eyes and blonde hair tied into two buns held by white cloth. She wears a tiny haniwa on her neck and wields a longer one as a sword. She wears a white shirt and poofy pants under yellow lamellar armor, purple armguards tied with red rope, and dark blue boots.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "117": {
            "uid": 117,
            "key": [
                "Medicine Melancholy"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Medicine Melancholy is a youkai doll. She manipulates poison and has a killing touch. She lives on the Nameless Hill, collecting Lilies of the Valley. She is ignorant but not naive. Medicine has dull blue eyes and blonde curly hair. She wears a burgundy shirt with red stitches, a red skirt with burgundy stitches, red shoes and a ribbon on her back and hair. Medicine always has a miniature doll of herself following her.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "118": {
            "uid": 118,
            "key": [
                "Meira"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Meira is a human samurai found wandering Gensokyo challenging both youkai and humans alike. She is brash and confident, but easily folds if her opponent is also confident. Meira has a strong crush on Reimu. She has purple hair and purple eyes. Meira wears a red and white robe similar to a samurai's outfit. She wields a katana.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "119": {
            "uid": 119,
            "key": [
                "Merlin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Merlin Prismriver is a poltergeist trumpeter. Her music can induce mania. She is the second sister of the Prismriver Sisters and the most energetic. Merlin has blue eyes and wavy light-blue hair. She wears a pink dress with blue and black trim. She has a white hat with a blue sun decoration. Merlin always has her trumpet nearby. She is same height as Lunasa & taller than Lyrica.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "120": {
            "uid": 120,
            "key": [
                "Mima"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mima is a vengeful spirit haunting the Hakurei Shrine. She can wield powerful magic and is stronger at night. Mima was Marisa's teacher. She is quite confident and a troublemaker, but has become less evil over time. Mima has long green hair and green eyes. She wears a blue wizard hat with a blue bow tied to it, a blue sleeveless dress with a white long-sleeved shirt, and has a ghost tail for legs. Mima carries a long staff with a large crescent moon at the tip.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "121": {
            "uid": 121,
            "key": [
                "Minamitsu",
                "Captain Murasa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Minamitsu Murasa is a ship phantom. She can cause shipwrecks. She lives at the Myouren Temple which is also her ship. Minamitsu has a bright and chatty personality, but also just casually murders people by drowning them. She is one of Byakuren's followers. Minamitsu has sea green eyes and short black hair. She wears a white sailor schoolgirl uniform and shorts with sea green lining, a sailors hat and a red neckerchief. Minamitsu carries around a ladle that can sink ships, as well as an anchor.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "122": {
            "uid": 122,
            "key": [
                "Minoriko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Minoriko Aki is a harvest god. She has the power to control the Autumn harvests. Minoriko lives near Youkai Mountain and is Shizuha's younger sister. Minoriko has unrefined behavior, is optimistic in Autumn but grows sadder as Winter approaches. She has red eyes and blond hair. Minoriko wears a yellow blouse with poofy sleeves, a long black skirt, a red apron with black straps and wheat patterns at the bottom and a floppy red hat with decorative grapes. Minoriko is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "123": {
            "uid": 123,
            "key": [
                "Miyoi",
                "Okunoda"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Miyoi Okunoda is a zashiki-warashi. She can manipulate memories. Miyoi lives in the Human Village and works at Geidontei as a poster girl. She is easygoing and a friend of Suika Ibuki who lets her live in her sake gourd. Miyoi has green eyes and shoulder-length pink hair. She wears a blue hat shaped like a whale and a blue apron with a drawing of a whale, a light blue shirt with pink ribbons, and a purple skirt decorated with ofuda. She has an apron with a whale design tied with a ribbon shaped like a whale tail.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "124": {
            "uid": 124,
            "key": [
                "Misaguji"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mishaguji are curse gods. They take the shape of transparent white snakes with red eyes. Suwako collects them. They can make fields fertile or destroy crops.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "125": {
            "uid": 125,
            "key": [
                "Momiji",
                "Inubashiri"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Momiji Inubashiri is a white wolf tengu. Her senses have enormous range, making it easy for her to find intruders. She patrols the Youkai Mountain. Momiji is very cooperative, dutiful, and enjoys playing dai-shogi. She is a colleague of Aya and Hatate but regularly butts heads with them. Momiji has short fluffy white hair and red eyes. She wears a red tokin, a white kimono with detached sleeves and a long black skirt with maple leaf designs. Momiji carries a shield and a dao sword.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "126": {
            "uid": 126,
            "key": [
                "Mugetsu"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Mugetsu is a demon found in Makai along with her older sister, Gengetsu. She wears a blue and pink maid outfit. Mugetsu has short yellow hair and yellow eyes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "127": {
            "uid": 127,
            "key": [
                "Mystia",
                "Lorelei"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Mystia Lorelei is a night sparrow youkai. She can drive people insane by singing and can cause night blindness. Mystia controls birds and winged insects. She's proud but mischievous. Mystia plays in a band with Kyouko. She is enterprising and owns a food stand that sells grilled lamprey. Mystia has grey eyes, short pink hair, owl-like ears, and light pink bird wings. She wears a brown dress with long white sleeves, and a brown hat and black shoes, both with wing ornaments.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "128": {
            "uid": 128,
            "key": [
                "Narumi",
                "Yatadera"
            ],
            "keysecondary": [
                ""
            ],
            "comment": "",
            "content": "Narumi Yatadera is an animated Jizo statue and magician. She can use magic by controlling life forces. She is introverted but is a friend of Marisa. She rarely leaves the Forest of Magic. Narumi has dark brown eyes, black hair tied into two long braids, and long earlobes. Narumi wears a long stone-colored dress with red buttons, a red capelet on her left shoulder, black sandals, red socks, and a very wide snow-covered conical straw hat.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "129": {
            "uid": 129,
            "key": [
                "Nemuno",
                "Sakata"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Nemuno Sakata is a yamanba. She can create sanctuaries. Nemuno lives in a shack on the Youkai Mountain. She is reclusive and chases off trespassers, living an extremely primitive lifestyle. Nemuno has red eyes and wavy waist-length grey hair. She wears blue detached sleeves, a yellow, orange and red one-shoulder dress, and is barefoot. Nemuno wields a massive cleaver with a red bow on the handle.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "130": {
            "uid": 130,
            "key": [
                "Nitori",
                "Kawashiro"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Nitori Kawashiro is a kappa. She can manipulate water. Nitori lives in the Genbu Ravine. She is skittish but incredibly curious and inventive and also loves cucumbers. She is friends with Marisa. Nitori enjoys inventing things and often sells her creations. Nitori is considered a leader among the kappa. She has blue hair tied into tufty twin tails and blue eyes. Nitori wears a blue dress with lots of pockets, a green hat, and blue wellington boots. Nitori has a dark blue backpack with a huge lock whose golden key is on her necklace.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "131": {
            "uid": 131,
            "key": [
                "Noroiko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Noroiko is a youkai with short dark red hair tied with a bow. She wears a purple skirt and shirt with white long sleeves. There is a red jagged line along the hem of her dress.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "132": {
            "uid": 132,
            "key": [
                "Nue",
                "Houjuu"
            ],
            "keysecondary": [
                "youkai",
                "myouren"
            ],
            "comment": "",
            "content": "Nue Houjuu is a nue. She can make objects unidentifiable and is over 800 years old. Nue is mischievous, but easily provoked. She lives at the Myouren Temple. Nue has neck-length black hair and red eyes. Nue has three red tentacles shaped like half-scissors on her right, and three blue tentacles shaped like demon tails on her left. She carries a trident, a snake wrapped around her right arm, and a black wristband on her left. Nue wears a black dress with a red spiral design and a white frilly collar with a red bowtie, black thigh high stockings, and red shoes.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0
        },
        "133": {
            "uid": 133,
            "key": [
                "Orange"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Orange is a youkai found in the Youkai Mountain. She has long red hair and red eyes. Orange wears a yellow cap, a white bow in her hair, and yellow and green clothing. She carries around a white baton.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "134": {
            "uid": 134,
            "key": [
                "Parsee",
                "Mizuhashi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Parsee Mizuhashi is a hashihime. She can manipulate jealousy but is often busy being jealous about something menial. Parsee guards the bridge to the Underworld. In direct conversation she is usually pleasant but always manages to find things to be jealous about. Parsee has fluffy blonde hair and green eyes. She wears a traditional Iranian dress which is brown with blue trim, a pink sash, a blue and black skirt, a pink scarf around her neck, knee high socks, and black shoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "135": {
            "uid": 135,
            "key": [
                "Remilia",
                "Scarlet Devil"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Remilia Scarlet is a vampire living in the Scarlet Devil Mansion. Remilia can manipulate the chains of fate, turn into a bat, and is able to but generally does not need to suck blood. She is over 500 years old. Remilia is Flandre's big sister, and Patchouli's best friend. Remilia's head maid is Sakuya and her gatekeeper is Meiling. Remilia acts childishly but tries to appear mature and refined. She is quite wise and speaks confidently. Remilia has red eyes, short lavender hair, bat wings and a petite frame. She wears a light-pink mobcap with red ribbon, light-pink dress with red ribbon on both sleeves, a very large red ribbon tied around her waist, and white slippers.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "136": {
            "uid": 136,
            "key": [
                "Renko",
                "Usami"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Renko Usami is a human college student. She can deduce her exact position by reading the stars. Renko is a physics major and values logic above all else. She is the other member of the Secret Sealing Club with Maribel. She is curious about alternate dimensions. Renko has shoulder-length brown hair and eyes. She wears a black hat with a bow, a white suit covered by a brown dress and a black mantle over them. She often carries a book with her. Renko can visit Gensokyo in her dreams with the help of Maribel.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "137": {
            "uid": 137,
            "key": [
                "Rika"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rika is a human engineer found near the Hakurei Shrine working on some projects. She is very intelligent even for Gensokyo itself as the technology she uses isn't even found there or used by the Kappa. Rika has long brown hair tied into two braids and brown eyes. She wears a white shirt with a purple bow below her collar, a black skirt, and carries around a piece of chalk. Rika has a tank she uses to travel around Gensokyo.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "138": {
            "uid": 138,
            "key": [
                "Rikako",
                "Asakura"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rikako Asakura is a human scientist found in Gensokyo. She values science more than magic although she can use both but she's considered a heretic by Reimu Hakurei. Rikako has long purple hair tied with a yellow ribbon and purple eyes. She wears a white lab coat with a yellow bow at her neck and small round glasses.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "139": {
            "uid": 139,
            "key": [
                "Ringo"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ringo is a moon rabbit. She grows in strength when consuming dango. Ringo deserted the Lunarian military where she worked as an informant, and now owns a dango stand along with Seiran. Ringo is fairly nonchalant. She has red eyes, short blonde hair, and short drooping rabbit ears. Ringo wears an orange crop top with green frills, yellow striped pumpkin breeches, and a brown patterned newsboy cap. She is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "140": {
            "uid": 140,
            "key": [
                "Rinnosuke",
                "Morichika",
                "Kourin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rinnosuke Morichika is a half-youkai half-human. He has no combat abilities but can understand the purpose of objects by examining them and create minor magical items. He lives and works in his antique shop, Kourindou. He knows Marisa well and often sees Reimu and Sumireko. Rinnosuke is somewhat introverted and does not express himself much, but is very curious and likes explaining things. Rinnosuke has short gray hair and yellow eyes. He wears glasses. Rinnosuke wears a thick blue and black robe, white boots, and carries a large red satchel.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "141": {
            "uid": 141,
            "key": [
                "Rumia"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rumia is a youkai girl who can manipulate darkness. She uses a ball of shadow to hide but can't see out of it. She errs around the human village, Forest of Magic, and Misty Lake. Rumia is clumsy, naive but relaxed & carefree. She is lazy & hunts humans but tends to get lost often. Rumia has red eyes & short blonde hair. She wears a black vest, white shirt & a red tie decorated with two large red beads. Rumia has a small red ofuda in her hair, she is unable to remove it.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "142": {
            "uid": 142,
            "key": [
                "Ruukoto"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ruukoto is a nuclear powered android maid owned by Reimu Hakurei to clean up the Hakurei Shrine. She is very enthusiastic about cleaning but can't do it effectively. Ruukoto has long green hair and green eyes. She wears a light-blue and white maid uniform and has a yellow radiation warning symbol on her back. Ruukoto is a gift from Yumemi Okazaki.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "143": {
            "uid": 143,
            "key": [
                "Saki",
                "Kurokoma"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Saki Kurokoma is the incarnation of the mythical horse of Prince Shoutoku. She has unmatched leg strength. She speaks casually yet politely and respects others' strengths but is self-conscious about her short height. She is the matriarch of the Keiga Family which is a major faction in the Animal Realm. Saki has red eyes, short black hair, large black wings, and a black horse tail. She wears a brown cowboy hat, light teal bandanna, a blue, red and brown dress with an orange skirt underneath, and high heel long leather boots.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "144": {
            "uid": 144,
            "key": [
                "Sakuya",
                "Izayoi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sakuya Izayoi is a human girl serving as the Scarlet Devil Mansion's head maid. Sakuya can stop time and is a knife throwing master. She is Remilia's most trustworthy servant but attacks Alice on sight. Sakuya acts very refined and polite but can be snippy and sassy. Sakuya is tall and elegant. She has blue eyes, silver hair in long braids on both sides of her face with green bows. Sakuya wears a blue French maid uniform with a white apron and white headband.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "145": {
            "uid": 145,
            "key": [
                "Sara"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sara is a demon in a mountain cave guarding the entrance to Makai. She has short purple hair and purple eyes. Sara wears a red dress with a white scarf and white sleeves. Shinki is Sara's mistress.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "146": {
            "uid": 146,
            "key": [
                "Sariel"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sariel is an angel of death found in the Fallen Temple. She wears a blue robe and has white hair and white eyes. Sariel has angel wings and carries around a staff.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "147": {
            "uid": 147,
            "key": [
                "Satono",
                "Nishida"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Satono Nishida is a human. She can increase a person' mental energy by dancing behind them. She lives in the Land of the Backdoor, serving Okina Matara along with her partner Mai. She is quiet but overly confident, and serves Okina unquestioningly. Satono has long hazel hair with long sidelocks and purple eyes. She wears a kazaori-eboshi, a pink dress with short sleeves, a white half apron and collar with yellow frills and a red bow, black kneesocks, and pink shoes. Satono often holds a bamboo stalk.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "148": {
            "uid": 148,
            "key": [
                "Satori",
                "Komeiji"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Satori Komeiji is a satori. She can read minds and copy attacks. Satori lives in Palace of the Earth Spirits. She is the older sister of Koishi and mistress of Rin and Utsuho. Satori is introverted but very smug. Satori has violet eyes and short violet hair with a black hairband. Her outfit is decorated with hearts which have yellow and red cords that feed her red third eye. Satori wears a blue shirt with yellow heart buttons, a pink skirt, white socks and pink slippers.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "149": {
            "uid": 149,
            "key": [
                "Seiga",
                "Kaku"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Seiga Kaku is a Taoist hermit. She is over 1400 years old and can pass through walls by using her hairpin. Seiga lives in the Hall of Dreams' Great Mausoleum. She owns Yoshika but treats her more like a pet. Seiga is a proud and devout taoist, but cares little for others, manipulating them for her own ends. Seiga was Toyosatomimi no Miko's teacher. Seiga has blue eyes and blue hair with two hair loops secured by a large hairpin. Seiga wears an ornate teal dress, a white and blue vest, and flower on a her belt. She has ofuda tied around her calves and wears black shoes and white socks.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "150": {
            "uid": 150,
            "key": [
                "Seija",
                "Kijin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Seija Kijin is an amanojaku. She can reverse anything into its opposite state. Seija tries to be hated and acts like the opposite of anyone she is with. The great majority of people have a poor opinion of her. Seija resides in the Shining Needle Castle with Shinmyoumaru. Seija has red eyes, black hair with red and white bangs, and small light blue horns. She wears a white dress with red and grey spade pattern, a blue ribbon around her waist, and is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "151": {
            "uid": 151,
            "key": [
                "Seiran"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Seiran is a moon rabbit. She can fire projectiles from other dimensions. Seiran deserted the lunarian military where she worked as an infiltrator. She now works at a dango stand in Gensokyo with Ringo. Seiran is positive but lazy and a poor conversationalist. Seiran has red eyes and dark blue hair tied into two bushy ponytails as well as two slender bunny ears with a golden clip around the right one. Seiran wears a periwinkle dress with yellow star and moon patterns and burgundy frills, transparent white bloomers and white socks. She carries a mochi mallet around.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "152": {
            "uid": 152,
            "key": [
                "Shanghai"
            ],
            "keysecondary": [
                "Alice"
            ],
            "comment": "",
            "content": "Shanghai is one of Alice Margatroid's dolls. Shanghai can use destructive magic. Shanghai wears a black dress with white apron, black sleeves & black shoes. She wears a pink ribbon in her hair and on collar.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "153": {
            "uid": 153,
            "key": [
                "Shinki",
                "Makai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Shinki is an immensely powerful goddess. Shinki created and rules Makai and its residents. She's proud and confident. Shinki has six white wings that can turn purple with red markings. She lives in her fortress, Pandaemonium. Shinki is a relative of Alice. Yumeko is Shinki's strongest creation and loyal servant. Shinki has light-blue eyes and long white hair tied into a sidetail with two red beads. Shinki wears a lavish red robe with a pink collar. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "154": {
            "uid": 154,
            "key": [
                "Shion"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Shion Yorigami is a poverty god. She spreads indescribably terrible misfortune, especially to herself. She is quiet, submissive, and uncaring of others. Shion is good friends with Tenshi and is Joon's elder sister. She has blue eyes and extremely long dark blue hair that flows like flames. Shion is somewhat tall but deathly thin. She wears a large blue bow on her head. Shion wears a gray short-sleeved hoodie, blue semi-transparent skirt, golden bracelets, and is barefoot. All of Shion's clothes are ragged and patchwork and she usually has an old cat ragdoll with her.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "155": {
            "uid": 155,
            "key": [
                "Shizuha",
                "Aki",
                "Minoriko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Shizuha Aki is a goddess of Autumn leaves. She can change the color of trees' leaves. Shizuha lives near Youkai Mountain with her elder sister Minoriko. She is energetic and optimistic when Autumn begins and grows sadder when Winter approaches. Shizuha has amber eyes and short blonde hair. She wears a headband with red maple leaves. She wears a long dress that is red but fades to orange with leaf-shaped cut outs at the bottom. Shizuha also wears a white collar, white socks, and black slippers.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "156": {
            "uid": 156,
            "key": [
                "Shou",
                "Toramaru"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Shou Toramaru is a tiger youkai and avatar of Bishamonten. She has the power to gather treasure and owns the Jeweled Pagoda. Shou lives at the Myouren Temple, where Nazrin keeps watch over her on behalf of Bishamonten. She is one of Byakuren's followers. Shou is composed, gentle, and dignified unless she's around friends. Surprisingly she isn't skilled in physical combat and is known to drink heavily. Shou has yellow hair with black stripes and golden eyes. She wears a lotus-shaped ornament on her head, and carries a spear. Shou wears a red and orange dress with a tiger pattern apron over a white robe.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "157": {
            "uid": 157,
            "key": [
                "Soga",
                "Tojiko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Soga no Tojiko is a ghost. She can cause thunderstrikes. Tojiko lives in the Halls of Dreams' Great Mausoleum and is a follower of Toyosatomimi no Miko. She is soft-hearted but quick to anger and regularly curses. Tojiko is Mononobe no Futo's friendly rival. Tojiko has light green hair, light green eyes, and two ghost tails where her legs should be. Tojiko wears a dark green dress with ofuda along the bottom and a kanmuri-style hat.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "158": {
            "uid": 158,
            "key": [
                "Star",
                "Sapphire",
                "Fairies of Light",
                "Fairy of Light"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Star Sapphire is one of the Three Fairies of Light. Star can detect moving things and has more common sense than other fairies. She is quite calm for a fairy. She is Sunny and Luna's friend. Star has long brown hair with a blue ribbon, amber eyes, and butterfly-shaped wings. Star is rather petite. She wears a frilly blue dress with a white frilly collar and short white sleeves, a white apron, a small blue string tie and brown laced boots.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "159": {
            "uid": 159,
            "key": [
                "Suwako",
                "Moriya"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Suwako Moriya is a goddess of the mountains. She can manipulate the shape and composition of land. Suwako is quite short, laid back but mischievous. Suwako is immensely powerful but hides it, preferring to act casually. Kanako is her rival and best friend. Suwako has shoulder-length blonde hair and grey eyes. Suwako wears a purple dress with elaborate frog designs, large white sleeves and a white collar. She wears white kneesocks and black loafers. Suwako has a distinctive wide-brimmed and tall brown hat with two frog eyes. Sanae Kochiya is a descendant of hers. Suwako collects and controls Mishaguji.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "160": {
            "uid": 160,
            "key": [
                "Tenma"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tenma is the leader of the tengu, and superior of Great Tengus. Tenma is known to have made a deal with Kanako Yasaka.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "161": {
            "uid": 161,
            "key": [
                "Tenshi",
                "Hinanawi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tenshi Hinanawi is a celestial. She can manipulate earth or read one's spirit with the Sword of Hisou. She's a bratty delinquent and can be disrespectful and egotistical. Tenshi uses Keystones and the Sword of Hisou in combat. She is friends with Shion and Iku. Tenshi has dark red eyes and long blue hair. Tenshi wears a white blouse with red bow at the collar, a long skirt patterned like a bright sky, a large light blue bow at her waist, and an apron with rainbow trimming and. Tenshi has a black hat with two peaches & leaves, lace-up brown boots.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "162": {
            "uid": 162,
            "key": [
                "Tewi",
                "Inaba"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tewi Inaba is an earth rabbit. She gives good luck to humans. She's the leader of the Earth rabbits, carefree but rather bratty and mischievous. Tewi lives in Eientei where she works with and regularly annoys Reisen. She is also Eirin's servant. Tewi is petite and has dark red eyes, black shoulder-length hair, and white droopy fluffy rabbit ears. Tewi wears a frilly pink nightgown, a carrot pendant and is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "163": {
            "uid": 163,
            "key": [
                "Fairies of Light",
                "Three Fairies of Light"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Three Fairies of Light are Sunny Milk, Luna Child, And Star Sapphire. They are fairies who are known to cause mischief. They reside inside a tree near the Hakurei Shrine.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "164": {
            "uid": 164,
            "key": [
                "Utsuho",
                "Reiuji",
                "Okuu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Utsuho Reiuji is a hell raven. She ate the Yatagarasu, and has the power of nuclear fusion which makes her one of the strongest people in Gensokyo. Utsuho regulates Former Hell's flames with her nuclear powers. Utsuho is Rin's best friend and is loyal to Satori. Utsuho is carefree and energetic, but dreadfully airheaded and dull-minded. Utsuho has very messy long brown hair with a large green ribbon, brown eyes, and black wings. Utsuho wears a white short-sleeved shirt, short green skirt, black boots and a white cape with a starry inner lining. Utsuho has the Yatagarasu's eye coming out of her sternum, a large red gem that looks like a crow's eye. She uses a control rod-shaped arm cannon to fire danmaku.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "165": {
            "uid": 165,
            "key": [
                "Urumi",
                "Ushizaki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Urumi Ushizaki is an ushi-oni. She can change the weight of her own possessions. Urumi lives near the Sanzu River, and raises prehistoric fish in it to sell them to humans. She is caring and will try to repel humans from the River by burdening them with her stone baby doll. Urumi has very fluffy shoulder-length hair and cow ears, grey on the right and black on the left. She also has red ox horns and ox tail. Urumi wears a loose cow-spotted jacket over a yellow crop-top and yellow pumpkin breeches with white frills, and red sandals.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "166": {
            "uid": 166,
            "key": [
                "Wakasagihime"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Wakasagihime is a mermaid. She grows in power when underwater. She lives in Misty Lake. Wakasagihime is polite and amiable but reserved. She is close friends with Sekibanki and Kagerou, and part of the Grassroots Youkai Network. Wakasagihime has shoulder-length dark blue hair in princess curls, dark blue eyes, and small fins where her ears are. Wakasagihime wears a frilly leaf-patterned kimono which is green and fades to a dull blue. It is tied with a purple obi. Instead of legs, she has a bluish fish tail.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "167": {
            "uid": 167,
            "key": [
                "Yachie",
                "Kicchou"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yachie Kicchou is a jidiao. She is able to make her opponents lose the will to fight back. Yachie lives in the Animal Realm and is the matriarch of the Kiketsu Family. Yachie is Saki's and Yuuma's rival. She polite on the surface but deceiving and manipulative. Yachie has red eyes, short blonde hair, gold antlers, a turtle shell and a scaly green tail. She wears a light blue shirt and skirt, white socks and black shoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "168": {
            "uid": 168,
            "key": [
                "Yamame",
                "Kurodani"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yamame Kurodani is a tsuchigumo. She manipulates infectious diseases, fires webs, and is a great architect. Yamame lives in the Fantastic Blowhole. She has a bright personality and avoids fighting if she can. Yamame has brown eyes and blonde hair tied up in a bun with a ribbon. Yamame wears a poofy black and brown dress with eight buttons and gold ribbons crisscrossing over it, black slippers, and white socks.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "169": {
            "uid": 169,
            "key": [
                "yin-yang",
                "yin-yang orb"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yin-yang orbs are Reimu Hakurei's main weapons against humans and youkai, extremely effective against youkai in particular. They were created by Misumaru Tamatsukuri, a god of craftsmanship.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "170": {
            "uid": 170,
            "key": [
                "Yatsuhashi",
                "Tsukumo"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yatsuhashi Tsukumo is a koto tsukumogami and the younger sister of Benben. Yatsuhashi can produce sounds. She is energetic and more forward than her sister. Yatsuhashi has brown eyes, short brown hair, and a magenta headband with black stripes. Yatsuhashi wears a white shirt with lilac accents, a purple bow at the back of her waist, a black skirt with a purple trim and is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "171": {
            "uid": 171,
            "key": [
                "Yoshika",
                "Miyako"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yoshika Miyako is a jiang shi. She can devour anything. Yoshika is the guard of the Hall of Dreams' Great Mausoleum and serves Seiga. She is mindless when under Seiga's orders, but is forgetful and takes everything literally. Yoshika has pale skin, dark blue hair, and eyes. She wears a blue cap with a yellow star, an ofuda on the forehead, a red Chinese-style shirt with pink frills on the sleeves which are also on her black skirt. Yoshika also wears black loafers. Yoshika holds her arms out like a zombie while hopping around.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "172": {
            "uid": 172,
            "key": [
                "Youmu",
                "Konpaku"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Youmu Konpaku is a half-phantom half-human, and expert swordswoman. Youmu lives in Hakugyokurou as a servant of Yuyuko. Youmu is straightforward, diligent, but easily manipulated. Youmu has silver eyes, silver hair and a black hairband with a large black ribbon. Her phantom-half manifests as a wisp-shaped ghost following her. She wears a green vest, green skirt, with a white shirt underneath. Youmu dual wields a katana called Roukanken and a wakizashi called Hakurouken.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "173": {
            "uid": 173,
            "key": [
                "Youki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Youki Konpaku was the first gardener for the Saigyouji clan at Hakugyokurou for about 300 years, before leaving it to his successor and student Youmu Konpaku. He, too, is a half-human half-phantom. No one currently knows his whereabouts. Youki is described as stubborn, prideful and intimidating. While teaching, he preferred not to rely on words; when he did speak, he would only say few words with a thundering voice.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "174": {
            "uid": 174,
            "key": [
                "Yukari's Crows",
                "Zenki",
                "Goki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yukari Yakumo has two youkai crows: Zenki and Goki. She uses them for surveillance.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "175": {
            "uid": 175,
            "key": [
                "Yumeko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yumeko is a demon serving as Shinki's maid and bodyguard in Pandaemonium. She is known to throw swords at her opponents. Yumeko has short curly yellow hair and yellow eyes. She wears a red and white maid uniform.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "176": {
            "uid": 176,
            "key": [
                "Yumemi",
                "Okazaki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yumemi Okazaki is a human professor of the Outside World. She uses artificial magic and works with Chiyuri Kitashirakawa. She is a creator who built the Probability Space Hypervessel and Ruukoto. She studies Magic in Gensokyo, learning how to recreate it artificially. Yumemi has red eyes and dark red hair. She wears a dark red dress and a matching cape.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "177": {
            "uid": 177,
            "key": [
                "Yuuka",
                "Kazami"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yuuka Kazami is a flower youkai. She can manipulate the power of flowers. Yuuka is overwhelmingly powerful and intimidating. She is quite playful but sadistic and likes bullying weaker people. Yuuka is very lazy and rarely leaves Mugenkan in the Garden of the Sun. Elly is her servant. Yuuka has red eyes and shoulder-length green hair. Yuuka wears a white shirt, a red plaid waistcoat and skirt, yellow neckerchief, black pantyhose and brown lace-up boots. She carries a white parasol that can block danmaku.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "178": {
            "uid": 178,
            "key": [
                "Yuyuko",
                "Saigyouji"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yuyuko Saigyouji is a ghost princess. Yuyuko can manipulate death and departed spirits. She is very cheerful, friendly, and is a gourmet. Yuyuko may seem like an airhead, but is actually cunning and smart. She manages the Netherworld and is the mistress of Hakugyokurou. Youmu is her servant and Yukari is her best friend. Yuyuko is the subordinate of Eiki Shiki. Yuyuko has brown eyes and short wavy pink hair. She is surrounded by small spirits. Yuyuko wears a light blue kimono with black trim and spirit motifs, and a blue mob cap.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "179": {
            "uid": 179,
            "key": [
                "Bamboo Forest",
                "Bamboo Forest of the Lost"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Bamboo Forest of the Lost is located opposite of Youkai Mountain relative to Human Village. The layout of forest is constantly shifting. Eientei is found in the Bamboo Forest. Mokou lives there and is not opposed to guiding humans. Kagerou, Tewi and other rabbits live there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "180": {
            "uid": 180,
            "key": [
                "Geidontei"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Geidontei is a traditional Japanese style bar located in the Human Village, owned by an old man who makes good stewed vegetables. Miyoi Okunoda works here as the poster girl.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "181": {
            "uid": 181,
            "key": [
                "Great Hakurei Barrier",
                "Hakurei Barrier"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Great Hakurei Barrier is the shield surrounding all Gensokyo. It was formed in 1885 by the Sages of Gensokyo. With it, Youkai can live peacefully. The only place to get through the barrier is the Hakurei Shrine. You can cross the barrier by being \"spirited away\".",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "182": {
            "uid": 182,
            "key": [
                "Heaven"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Heaven is a series of realms. People who have reached nirvana can access it. It can be accessed from the top of Youkai Mountain. Tenshi and Iku live in Heaven.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "183": {
            "uid": 183,
            "key": [
                "Hakurei Shrine"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Hakurei Shrine is located on East side of Gensokyo. Reimu Hakurei lives there and maintains it. Suika, Aunn, Shinmyoumaru and Ruukoto live there as well. The Shrine is a little run down and rarely gets donations. Reimu occasionally hosts festivals at the Shrine.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "184": {
            "uid": 184,
            "key": [
                "New Hell"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hell is a collection of places to be tortured after death. It is different from Former Hell as all the spirits moved to the New Hell. Hecatia Lapislazuli manages the entirety of Hell as its goddess. The Animal Realm can also be found here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "185": {
            "uid": 185,
            "key": [
                "Human Village"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Human Village is where most of Gensokyo's Humans live and is the only human settlement. Some youkai come to the village to shop. It's considered the safest place in all of Gensokyo. Outsiders often live here, safe from Youkai. Keine, Akyuu, Kosuzu, Sekibanki, and Miyoi live here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "186": {
            "uid": 186,
            "key": [
                "Misty Lake"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Misty Lake is a large lake located at the foot of Youkai Mountain. Many fairies and youkai alike appear to gather here, especially during the summertime, given the abundant water. The lake and its environs appear to be the home of Cirno, Daiyousei and Wakasagihime. The Scarlet Devil Mansion and Ruined Western Mansion are near Misty Lake. The Spring Path is also close by.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "187": {
            "uid": 187,
            "key": [
                "Moriya Shrine"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Moriya Shrine is near the top of Youkai Mountain. It stands next to Wind God's Lake. It is a Shinto shrine that was transported from the outside world. It is the home of Sanae, Kanako, and Suwako.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "188": {
            "uid": 188,
            "key": [
                "Muenzuka",
                "Road of Reconsideration"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Muenzuka is located at the end of the Road of Reconsideration. Muenzuka is a small wooded area known for its poisonous, deep red colored spider lilies. It is the graveyard of humans without relatives, or from the Outside World. Treasures from the Outside World tend to float here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "189": {
            "uid": 189,
            "key": [
                "Myouren",
                "Cemetary",
                "Graveyard"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Myouren Temple Cemetery is found near the Myouren Temple. The Cemetery is very old and holds the entrance into the Hall of Dreams' Great Mausoleum. Kogasa Tatara can be found here, trying to scare people.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "190": {
            "uid": 190,
            "key": [
                "Netherworld"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Netherworld is where spirits go after death. It contains lots of ghosts and phantoms. They attack any humans that trespass. Yuyuko and Youmu can be found here, who live in the Hakugyokurou, a ghost shrine known for cherry blossom gardens. The Netherworld is calmer than Hell. Yuyuko manages the Netherworld.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "191": {
            "uid": 191,
            "key": [
                "Palace of the Earth Spirits"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Palace of the Earth Spirits is in the center of Former Hell. It's a western-style mansion with stained glass windows. Despite the name, there are no spirits there. Satori, Rin and Utsuho live there. Sometimes, Koishi is present.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "192": {
            "uid": 192,
            "key": [
                "Remains of Blazing Hell",
                "Hell of Blazing Fires"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Remains of Blazing Hell is under Former Hell. It was a place where criminals were banished to, but now serves as the energy source for the Nuclear Furnace. Rin carts corpses to it while Utsuho powers the Nuclear Furnace.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "193": {
            "uid": 193,
            "key": [
                "Road of Reconsideration"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Road of Reconsideration is a road where red spider lilies bloom. It's located between the Forest of Magic and Muenzuka.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "194": {
            "uid": 194,
            "key": [
                "Scarlet Devil Mansion",
                "SDM",
                "Scarlet Devil"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Scarlet Devil Mansion is an European style mansion located on the ridge of Misty Lake, next to the Youkai Mountain. This is the home of Remilia, Flandre, Sakuya, Patchouli, Meiling, and Koakuma.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "195": {
            "uid": 195,
            "key": [
                "Suzunaan"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Suzunaan is a traditional Japanese book renter located in the Human Village. The books are normally from the Outside World. Although it is a book lender, they also sell books, and even provide a small book printing service. The Gensokyo Chronicle written by Hieda no Akyuu was also printed and bound here. Kosuzu Motoori works here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "196": {
            "uid": 196,
            "key": [
                "Untrodden Valley"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Untrodden Valley is located at the very base of the Youkai Mountain. It is the hideout of the kappa.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "197": {
            "uid": 197,
            "key": [
                "Underworld"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Underworld is a world under Gensokyo containing Former Hell and the Palace of the Earth Spirits. It can be reached through the Rainbow Cavern of Earth Spirits or the Fantastic Blowhole.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "198": {
            "uid": 198,
            "key": [
                "Youkai Mountain"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Youkai Mountain is Gensokyo's biggest mountain and volcano. It has many known locations such as the Wind God's Lake, Moriya Shrine, the Untrodden Valley, and the Great Youkai Forest at the base. It is ruled by the Tengu. A number of gods can also be found on the mountain, Kanako having the highest rank among them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "199": {
            "uid": 199,
            "key": [
                "Youkai Trail"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Youkai Trail is located near the Human Village. Mystia operates a food stand there to scam humans.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "200": {
            "uid": 200,
            "key": [
                "Spell Card Rules"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Spell card rules are laws forbidding Gensokyo residents to kill others. They are enforced throughout all of Gensokyo. Breaking them results in extermination. These rules rejects a system where the strongest has the right to rule, and gives humans and weaker youkai a chance to have a word in conflicts.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "201": {
            "uid": 201,
            "key": [
                "Danmaku",
                "Spell Card"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Danmaku is a barrage of bullets made from magic. To win a danmaku battle, one must dodge or outperform the pattern of projectiles.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "202": {
            "uid": 202,
            "key": [
                "Youkai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Youkai are spiritual beings that survive on belief. They often take on human forms, usually of cute girls. They cannot be defeated by attacks that do not have enough \"meaning.\" Youkai mainly feed on humans or human fear.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "203": {
            "uid": 203,
            "key": [
                "Spell Card"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Spell cards are powerful magical patterns that enhances the user's attack and defensive abilities for a short time. They are often flashy. Users have to call them out before using them.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "204": {
            "uid": 204,
            "key": [
                "Raiko",
                "Horikawa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Raiko Horikawa is a taiko drum tsukumogami. She can make anything follow a rhythm. She is laid-back and friendly, putting her freedom and that of other tsukumogami above everything else. Raiko has short wavy red hair and red eyes. She wears a black and red flannel shirt tucked in a short white skirt, has a purple tie, a white blazer, short purple boots with red laces and bass drum mallets attached to the heels. She sits on a flying ornate drum kit with a flower pattern.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "205": {
            "uid": 205,
            "key": [
                "Wolf Tengu",
                "White Wolf Tengu",
                "Tengu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "White wolf tengu are anthropomorphic white wolves with a human body structure. They are the protectors of the Youkai Mountain and will attack trespassers. White wolf tengu are known to be avid players of shogi.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "206": {
            "uid": 206,
            "key": [
                "Shinigami"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Shinigami are grim reapers. They are tasked to guide spirits to be judged and ferry them across the Sanzu River. Shinigami wield scythes and some can see the life spans of mortals.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "207": {
            "uid": 207,
            "key": [
                "Tsukumogami"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tsukumogami are objects or tools inhabited by a vengeful spirit seeking revenge on the humans that discarded them. Tsukumogami appear as humans carrying the objects they once were.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "208": {
            "uid": 208,
            "key": [
                "Moon Rabbit"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Moon rabbits are from the moon and are stronger than earth rabbits. They can transform into humans with rabbit ears and use telepathy. Moon Rabbits are seen as tools by Lunarians and are used for farming, making medicine, cleaning and as soldiers. A few fled to Gensokyo.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "209": {
            "uid": 209,
            "key": [
                "Kitsune"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kitsune are youkai foxes with up to nine tails. They have incredible magical powers and can shapeshift.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "210": {
            "uid": 210,
            "key": [
                "Nekomata"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Nekomata are youkai cats with multiple tails. They use necromancy or shamanism and grow more powerful every ten years when they grow a new tail.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "211": {
            "uid": 211,
            "key": [
                "Fairy",
                "Fairies"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Fairies in Gensokyo are playful, mischievous childlike beings. They are born from nature and indestructible, reappearing unless their habitat is destroyed. Fairies are made of pure life force. They come in all shapes and colors based on their element.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "212": {
            "uid": 212,
            "key": [
                "Flandre",
                "Scarlet Devil"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Flandre Scarlet is a vampire living in the Scarlet Devil Mansion. She has the power to destroy anything, but does not control that ability well. Flandre is Remilia's little sister. She scares Scarlet Devil Mansion residents due to her unstable behavior, as she was jailed for 495 years by Remilia. Even then, she tries to play with guests, her sister and her servants, sometimes too insistently. Flandre is childlike, innocent and excitable but sassy. Flandre has red eyes, short blonde hair, and a short left sidetail. She wears a red dress and vest, a pink mob cap with red ribbon, and has a pair of rainbow crystal wings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "213": {
            "uid": 213,
            "key": [
                "Ichirin",
                "Kumoi",
                "Unzan"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ichirin Kumoi is a youkai and Nyuudou user. She has the ability to control Unzan as well as her own danmaku powers. Ichirin is rather mature and tenacious but too eager to see good in people. She guards the Myouren Temple and is one of Byakuren's followers. Ichirin has wavy shoulder-length blue hair and blue eyes. She wears a white and blue dress with a blue veil, a red orb around her neck, and a black and gold Japanese-style kesa she wears over her shoulder. Ichirin also wears white shoes and carries a large golden ring to control Unzan.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "214": {
            "uid": 214,
            "key": [
                "Keine",
                "Kamishirasawa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Keine Kamishirasawa is a were-hakutaku. She has the power to create history as a human and eat history as a hakutaku. Keine is a teacher and guardian of the Human Village. She is friendly with humans but not youkai and hides her youkai identity. Keine is friends with Mokou. Keine is tall and has silvery blue hair and brown eyes as a human; but silvery green hair and red eyes when in her hakutaku form. Keine wears a blue dress over a white frilly skirt, and a blue hat with a very large red ribbon. In her Hakutaku form, she has horns with a red bow on the left one, and her dress is green.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "215": {
            "uid": 215,
            "key": [
                "Komachi",
                "Onozuka"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Komachi Onozuka is a shinigami. She can manipulate distances. Komachi ferries spirits across the Sanzu River and is Eiki's subordinate. Her boat is called the \"Titanic.\" She is lazy, carefree, and chatty. Komachi dislikes when people disrespect Eiki. Komachi is imposingly tall, has red eyes and shoulder-length red hair in two ponytails tied with hair beads. Komachi carries a scythe. She wears a white dress underneath a blue vest, has an obi with a large coin tied to it, and wears platform sandals. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "216": {
            "uid": 216,
            "key": [
                "Futo",
                "Mononobe"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mononobe no Futo is a Taoist practicing hermit. She can manipulate feng shui and carries a lot of plates to use as weapons. She lives in the Hall of Dreams' Great Mausoleum. Futo is over 1400 years old. She is gentle at heart, but is stuck in the past and talks in an antiquated manner. Futo is a follower of Toyosatomimi no Miko and friendly rivals with Soga no Tojiko. Futo has grey eyes and hair. She wears a pink Heian Era karinginu with a purple skirt. She also wears a distinct eboshi on her head.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "217": {
            "uid": 217,
            "key": [
                "Okina",
                "Matara"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Okina Matara is a secret god. She can create doors on the back of anything to manipulate its energy. Okina lives in the Land of the Back Door. She's prideful, and a huge showoff, favoring those who think highly of her. Okina is one of the Sages of Gensokyo. Satono and Mai are her servants. Okina has long, blonde hair and gold eyes. She wears a yellow tabard adorned with a pattern of green stars.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "218": {
            "uid": 218,
            "key": [
                "Patchouli",
                "Patche",
                "Patchy",
                "Patchouli Knowledge"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Patchouli Knowledge is a youkai magician. She is very skilled at all types of magic. Patchouli is the librarian of the Scarlet Devil Mansion. Patchouli is a stereotypical shut-in and is not very sociable, but quite witty. She is friends with Marisa, who steals her books regularly, and as a fellow magician, is acquainted with Alice. Koakuma is Patchouli's servant. She is physically weak and asthmatic. Patchouli has long purple hair and purple eyes, wearing a pink nightgown and night cap with a gold crescent moon pin.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "219": {
            "uid": 219,
            "key": [
                "Ran Yakumo"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ran Yakumo is a kitsune and shikigami of Yukari. She has a shikigami of her own, Chen, and is very powerful by herself. Ran performs domestic duties for Yukari, and does maintenance on the Great Hakurei Barrier. She is peaceful and gentle. Ran has yellow eyes, short blonde hair, and nine fox tails. Ran is fairly tall. She wears a white dress with purple cuffs and collar, and an indigo tabard with white print. Ran has a light pink two-tipped hat decorated with amulets hiding her fox ears. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0
        },
        "220": {
            "uid": 220,
            "key": [
                "Reimu",
                "Hakurei"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Reimu Hakurei is a human shrine maiden. Reimu's duty is to exterminate youkai. She maintains the Hakurei Shrine. Reimu is aloof to strangers, ruthless to enemies; but a great friend. She’s prideful and quite arrogant due to it. She is quick to anger, but she’s also quick to forget. She is responsible for the safety of Gensokyo and maintains balance between humans & youkai. Reimu is Marisa's best friend, rivals with Sanae, and Yukari is her mentor of sorts.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "221": {
            "uid": 221,
            "key": [
                "Orin",
                "Kaenbyou",
                "Rin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rin Kaenbyou or \"Orin\" is a kasha. She can talk to spirits and control vengeful ones. Rin carries corpses to Former Hell's flames using a hand cart. She is positive and energetic. Rin is one of Satori's pets and Utsuho is her best friend. She has black cat ears, red eyes, and fiery red hair tied into twin braids with black ribbons. Rin wears a very dark green dress with green frills, several anklets and a ribbon around her left leg, and black ribbon pumps.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "222": {
            "uid": 222,
            "key": [
                "Shinmyoumaru",
                "Sukuna"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Shinmyoumaru Sukuna is a young inchling princess. She can use the Miracle Mallet and the Shining Needle Sword. Shinmyoumaru lives in the Shining Needle Castle with Seija. Shinmyoumaru acts and speaks like a child and is incredibly gullible. She has short lavender hair and purple eyes and is only a few inches tall. Shinmyoumaru wears a pink kimono with a floral pattern, a black obi and travels around in a floating bowl. She is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "223": {
            "uid": 223,
            "key": [
                "Sekibanki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sekibanki is a rokurokubi. She can make her head fly or stretch her neck out. Sekibanki lives in the Human Village under the guise of a human. She is a little prideful but avoids people and is rather cynical. She is good friends with Kagerou and Wakasagihime and is a part of the Grassroots Youkai Network. Sekibanki has short red hair and red eyes. Sekibanki wears a red and blue capelet she hides her lower face with, a black and red long sleeved shirt, and a red skirt.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "224": {
            "uid": 224,
            "key": [
                "Sunny",
                "Sunny Milk"
            ],
            "keysecondary": [
                "fairy",
                "fairies"
            ],
            "comment": "",
            "content": "Sunny Milk is one of the Three Fairies of Light. She has the power to refract light to make things invisible. Sunny is very curious about everything, and very energetic. She is Luna's and Star's friend. Sunny has short red hair held in tufty twintails with red ribbons, blue eyes, and a pair of oblong wings. Sunny is rather petite. She wears a red and white dress with many frills, long sleeves, a red obi and a yellow neckerchief, brown shoes, and a white maid headband.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "225": {
            "uid": 225,
            "key": [
                "Suika",
                "Ibuki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Suika Ibuki is an oni. She can manipulate density and sparseness. She is jolly and childish but immensely strong. Suika enjoys festivals and parties and is always, without exception, drunk. She often stays at the Hakurei Shrine and is friends with Reimu, Yukari, Yuugi and Miyoi. Suika has two long horns on her head with a red ribbon on the left, long brown hair with a large red ribbon in it, and brown eyes. She wears a tattered pale pink blouse, a long purple and pink skirt with flame patterns, cloth bracers and ribbon pumps. Suika carries a large sake gourd. Suika is quite short and petite.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "226": {
            "uid": 226,
            "key": [
                "Sumireko",
                "Usami"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sumireko Usami is an outsider human. She can use psychic powers and access Gensokyo through her dreams. She has a superiority complex. Sumireko considers Reimu and Marisa her friends and Mokou her friendly rival. Sumireko has brown eyes and messy shoulder-length brown hair. She wears a black hat with a white bow along with under-framed red glasses, a purple plaid skirt and matching sleeveless dress over a white blouse with long sleeves. Sumireko wears a black bolo tie, white gloves, white socks with ribbons, black shoes, black cloak with red, rune-inscribed inner lining, and carries a smartphone that she takes lots of pictures with.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "227": {
            "uid": 227,
            "key": [
                "Toyosatomimi",
                "Miko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Toyosatomimi no Miko is a saint and hermit. She is the reincarnation of Prince Shoutoku, who spread Buddhism but is now a follower of Taoism. Miko is immortal, can listen to ten conversations at the same time and use Taoist magic. Miko is known to be casual and often jokes around. She lives in the Hall of Dreams' Great Mausoleum or Senkai. Mononobe no Futo and Soga no Tojiko are her followers. Seiga is Miko's taoism mentor. Miko has platinum blonde hair styled like tufty horns and pale brown eyes. She wears purple earmuffs, a white dress over a purple skirt, and a large purple cape. Miko carries her Seven Star Sword.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "228": {
            "uid": 228,
            "key": [
                "Wriggle",
                "Nightbug"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Wriggle Nightbug is a firefly youkai. She can control other insects. Wriggle is energetic, caring about nature, but very forgetful and easily angered, especially by people who insult insects. Wriggle has blue eyes, teal hair, and bug-like antennae. She wears a white shirt, a black cape with red lining that looks like insect wings, blue shorts, and red shoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "229": {
            "uid": 229,
            "key": [
                "Yuki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yuki is a witch who specializes in fire magic. She lives in Makai in the World of Ice and Snow along with Mai. Yuki has yellow hair and yellow eyes. She wears a dark red hat with a pink ribbon and a dark red and pink dress.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "230": {
            "uid": 230,
            "key": [
                "Yukari",
                "Yakumo"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yukari Yakumo is a unique youkai. She can manipulate the boundaries of anything. Yukari likes to sleep, and enjoys life freely. She is one of the Sages of Gensokyo. Yukari is a manipulative mastermind and is secretive about her real goals. Yukari is friendly towards Reimu but messes with her. Yukari is best friends with Yuyuko, friends with Suika, and Ran is her Shikigami. Yukari is tall and mature-looking. Yukari has gold eyes and very long blonde hair with many red ribbons. She wears a purple tabard with trigrams over a pale pink Western dress with black sleeve cuffs. Yukari wears a pink mob cap with a red ribbon, and usually carries a parasol.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "231": {
            "uid": 231,
            "key": [
                "Yuugi",
                "Hoshiguma"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yuugi Hoshiguma is an oni. She wields the power of unexplained phenomena. Yuugi lives in Former Hell's Hot Spring Town, which she manages. She is very blunt, straightforward, and dislikes weakness. Yuugi's physical strength defies description. Yuugi is Suika's best friend. Yuugi has red eyes, a single long starry red horn on her forehead, and long blonde hair. She wears a white short-sleeved shirt with red trim, a dark blue semi-transparent skirt with red highlights, and geta sandals. Yuugi has broken manacles on her wrists and carries a starry red sake dish that improves any sake poured in it.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "232": {
            "uid": 232,
            "key": [
                "Kasha"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kasha are hell cats who steal corpses from funerals and bring them to the Hell of Blazing Flames as fuel to regulate its heat.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "233": {
            "uid": 233,
            "key": [
                "Makai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Makai is a location behind the Hakurei Shrine in the mountains. Access to it is sealed, but there are ways to go around it. It is created by Shinki. A toxic miasma fills the air, which is poisonous to normal beings but increases magical power. It houses mostly demons. The Ruins of Vina, Fallen Temple, Makai City, World of Ice and Snow, Pandaemonium, Wonderland, and Hokkai are found in Makai.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "234": {
            "uid": 234,
            "key": [
                "Fallen Temple"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Fallen Temple is located somewhere in Makai. It's a giant broken down temple with a giant crucifix hanging in the lobby. It houses the angel of death Sariel.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "235": {
            "uid": 235,
            "key": [
                "World of Ice and Snow",
                "Makai",
                "Yuki",
                "Mai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The World of Ice and Snow is located somewhere in Makai. It's a barren snowy wasteland with a frozen river running through. Yuki and Mai live around here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "236": {
            "uid": 236,
            "key": [
                "Wonderland"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Wonderland is a location in Makai created in the distant past by Alice Margatroid. Alice visits it sometimes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "237": {
            "uid": 237,
            "key": [
                "Pandaemonium"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Pandaemonium is located in Makai right after the World of Ice and Snow. It's a giant Fortress made of a crystalline material built by and houses Shinki. It's in a devastated state after Shinki lost control.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "238": {
            "uid": 238,
            "key": [
                "Ellen"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ellen is a witch wandering Gensokyo. She looks very young but she's actually immortal while having a childish mindset. Ellen is short, has long blonde hair, and yellow eyes. She wears a red and white dress and a red bow on her head.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "239": {
            "uid": 239,
            "key": [
                "Elly"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Elly is a former shinigami. She is the servant of Yuuka Kazami and gatekeeper of Mugenkan. She's excitable but lonely. Elly uses a scythe to fight. She has curly shoulder-length blonde hair and yellow eyes. Elly wears a pink hat with a red ribbon, a dark red and pink dress and red shoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "240": {
            "uid": 240,
            "key": [
                "Louise"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Louise is a demon found in Makai. She's really polite and will often try not to push things too far. She wants to leave Makai. Louise has yellow eyes and short yellow hair. She wears a white hat with a purple birron and a white dress with a purple collar.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "241": {
            "uid": 241,
            "key": [
                "Mini-Hakkero"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mini-Hakkero is a magical device owned by Marisa Kirisame. It can fire the Master Spark. The Mini-Hakkero is a hand-sized, octagonal piece of wood inscribed with eight Taoist trigrams. Its internal components are made from hihiirokane. It can generate intense heat and magical energy, and the continuous beam it fires looks like a giant laser of rainbow energy.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "242": {
            "uid": 242,
            "key": [
                "Kourindou"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kourindou is an antique store owned by Rinnosuke located between the Forest of Magic and the Human Village. It supposedly sells antiques and has an extensive inventory. It is mostly a place to barter for items from the outside world. Kourindou gets very little customers and is rather poorly maintained. Marisa visits Kourindou regularly.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "243": {
            "uid": 243,
            "key": [
                "Master Spark"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Master Spark is Marisa's signature spellcard. The Master Spark is a gigantic laser beam fired from the Mini-Hakkero. It is incredibly strong and intimidating. The idea was stolen from Yuuka Kazami.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "244": {
            "uid": 244,
            "key": [
                "Purification Rod",
                "Gohei"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Purification Rod or \"gohei\" is owned by Reimu Hakurei. It is used to exterminate youkai. Reimu uses her gohei to fire danmaku.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "245": {
            "uid": 245,
            "key": [
                "Kakashi Spirit News",
                "Hatate"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kakashi Spirit News is ran by Hatate Himekaidou and is the rival of Bunbunmaru Newspaper. It uses spirit photography, so the articles are very in-depth and informative, but also from the past, so the information is outdated.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "246": {
            "uid": 246,
            "key": [
                "Keystone"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Keystones are holy rocks that can suppress earthquakes or cause them. Tenshi rides them and uses them to fight. They are lumps of black granite wrapped with shimenawa ropes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "247": {
            "uid": 247,
            "key": [
                "Lunar Veil"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Lunar veils are pieces of cloth sewn with pure moonlight allowing the wearer to fly around freely, including through space.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "248": {
            "uid": 248,
            "key": [
                "Ofuda"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Ofuda are talismans for purification, exorcism, or protection in Shinto religion.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "249": {
            "uid": 249,
            "key": [
                "Onbashira"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Onbashira are blessed wooden pillars that Kanako uses to fight, either as projectiles or as melee weapons.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "250": {
            "uid": 250,
            "key": [
                "Probability Space Hypervessel",
                "Yumemi",
                "Chiyuri"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Probability Space Hypervessel is a large ship that's capable of time travel. Its captain Yumemi Okazaki and its lone crew member Chiyuri Kitashirakawa used this vessel to travel to Gensokyo in order to prove the existence of magic.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "251": {
            "uid": 251,
            "key": [
                "Yama",
                "Enma"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yama are the judges of life and death of Gensokyo. They judge spirits ferried by shinigami across the Sanzu River. Each Yama has a rod of remorse.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "252": {
            "uid": 252,
            "key": [
                "Tsukuyomi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Lord Tsukuyomi is the brother of Amaterasu and lord of the Lunar Capital. He is a few million years old.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "253": {
            "uid": 253,
            "key": [
                "Moon"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Gensokyo's moon is like Earth, with green fields and lakes. Lunarians and Moon Rabbits live in the safety of the Lunar Capital.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "254": {
            "uid": 254,
            "key": [
                "Lunarian Capital",
                "Lunar Capital"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Lunarian Capital is a large city inhabited by the lunarians and moon rabbits. Its technology and weaponry are far more advanced than the Outside World. It is located on the moon. The Lunar Defence Corps is it's military force. It is home to Toyohime, Yorihime, Rei'sen, Sagume and Tsukuyomi.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "255": {
            "uid": 255,
            "key": [
                "Watatsuki",
                "Yorihime"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Watatsuki no Yorihime is a lunarian princess and the younger sister of Toyohime. Yorihime can borrow power from gods, can absorb knowledge and is a superb swordswoman. Yorihime's strength and skills are unmatched by anyone in Gensokyo or the moon. Udongein was her pet and Rei'sen is her current pet. Yorihime respects Eirin as her former teacher. Yorihime is the leader of the Lunar Defense Corps, she is seen as stern and serious. Yorihime has brown eyes and light purple hair tied into a ponytail with a yellow ribbon. She wears a white short-sleeved blouse with a dark red dress over it, golden bracelets, short red boots and a large belt.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "256": {
            "uid": 256,
            "key": [
                "Rei'sen"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rei'sen is a moon rabbit and the pet of Yorihime and Toyohime. She has the ability to teleport short distances. Rei'sen was formerly a soldier of the Lunar Defense Corps. She is a little shy and easily intimidated. Rei'sen has short light purple hair, red eyes and white fluffy bunny ears. She wears a black business suit, a white shirt, a red tie, a grey skirt, black kneesocks and loafers.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "257": {
            "uid": 257,
            "key": [
                "Hell Raven"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hell Ravens are found in Hell where they help maintain the Remains of Blazing Hell. They are humanoids with black wings and able to control fire, but are not Tengu.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "258": {
            "uid": 258,
            "key": [
                "Sanzu River"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Sanzu River is where spirits cross over to the Netherworld by paying a shinigami's boat ride. Komachi Onozuka is the ferrywoman. Only Shinigami and passengers can cross the river, everything else will sink and suffer a horrible fate. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "259": {
            "uid": 259,
            "key": [
                "Senkai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Senkai is an area similar to Gensokyo created Toyosatomimi no Miko for her and her followers. It is a realm where hermits can rest and meditate without being interrupted by others. It's accessed via the principle that any crack contains limitless space, which connects the world to any other location allowing it to be accessed from anywhere.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "260": {
            "uid": 260,
            "key": [
                "Garden of the Sun"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Garden of the Sun is located in the heart of Gensokyo. Sunflowers are everywhere in the Garden. Lots of youkai and fairies gather at this spot for concerts or for flower viewing. It's hard to leave the Garden. In the middle of the garden lies Mugenkan. Yuuka, Elly and Eternity Larva can be found here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "261": {
            "uid": 261,
            "key": [
                "Ruins of Vina"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Ruins of Vina are located somewhere in Makai. It used to be a giant castle but now it houses a demon known as Elis.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "262": {
            "uid": 262,
            "key": [
                "Forest of Magic",
                "Forest"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Forest of Magic is located near the Human Village. Many magicians live in this forest for the sake of increasing their magical powers with hallucinogenic mushrooms, and it is home to many repulsive things. Ignoring the dangerous environment, it's both a safe and secretive place to seclude oneself, or a fairly nice place to live for people who don't like to be disturbed. Marisa, Alice and Rinnosuke all live in the Forest of Magic.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "263": {
            "uid": 263,
            "key": [
                "Dream World"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Dream World is a world of dreams ruled by the baku. You have to be asleep in order to reach it. Doremy Sweet lives here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "264": {
            "uid": 264,
            "key": [
                "Earth Rabbit",
                "Rabbit"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Earth rabbits are natives of Gensokyo often wielding great magic capabilities and the ability to transform into either a rabbit or a girl with rabbit ears. Tewi leads the earth rabbits. They live in the Bamboo Forest of the Lost. They have allied themselves with the residents of Eientei and work there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "265": {
            "uid": 265,
            "key": [
                "Nue"
            ],
            "keysecondary": [
                "youkai"
            ],
            "comment": "",
            "content": "Nue are chimera-like youkai and extremely rare in Gensokyo. They are able to make themselves and other objects unrecognizable to the point that they looks like something completely different.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0
        },
        "266": {
            "uid": 266,
            "key": [
                "Wind God's Lake"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Wind God's Lake is located on top of the Youkai Mountain, next to Moriya Shrine. It has holy properties.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "267": {
            "uid": 267,
            "key": [
                "Canal of Willows"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Canal of Willows is a forest of willow trees located near the Human Village. It's said to be peaceful as there are rarely any youkai wandering the area.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "268": {
            "uid": 268,
            "key": [
                "Higan"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Higan is on the other side of the Sanzu River. Higan has no night or day, no weather, and no seasons. It is an endless expanse of flowers with gentle warmth. Higan is a place where departed souls are judged by Eiki Shiki. Komachi Onozuka lives here. Kutaka Niwatari works here as the gatekeeper.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "269": {
            "uid": 269,
            "key": [
                "Mayohiga"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mayohiga is an abandoned village located near the Great Hakurei Barrier somewhere in the mountains. Humans tend to stumble across it when they try to leave Gensokyo without using the Hakurei Shrine. Taking something from Mayohiga gives good luck. Cats live in Mayohiga because Chen brings them there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "270": {
            "uid": 270,
            "key": [
                "Hatate",
                "Himekaidou",
                "Kakashi Spirit News"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hatate Himekaidou is a crow tengu living on Youkai Mountain. She can use spirit photography to see things from somewhere else. Her articles are less sensationalist than Aya's, who is her rival. Hatate is really lazy but chipper and friendly. She is a shut in and rarely leaves home. Hatate has brown eyes and brown hair in pigtails with purple ribbons. She wears a pink shirt with a frilly collar, black tie, a purple tokin, a checkered purple and black skirt, and geta sandals.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "271": {
            "uid": 271,
            "key": [
                "Mamizou",
                "Futatsuiwa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mamizou Futatsuiwa is a bake-danuki. She can disguise herself or things around her. Mamizou is mischievous but good-natured and quite responsible. She lives in the Tanuki Forest, is a guest of the Myouren Temple and a friend of Nue. She lends money to poor humans. Mamizou has brown eyes, light brown shoulder-length hair, tanuki ears, and a giant, fluffy striped tail. She wears a green leaf on her head, and glasses. Mamizou wears a pink shirt with a leather apron, a skirt striped like her tail, and carries a bottle of sake.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "272": {
            "uid": 272,
            "key": [
                "Hakugyokurou"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hakugyokurou is a ghost shrine located in the Netherworld. The youkai cherry tree Saigyou Ayakashi is dormant in its gardens. Hakugyoukurou is the home of Yuyuko and Youmu.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "273": {
            "uid": 273,
            "key": [
                "Tanuki Forest"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Youkai Tanuki Forest is located near the Human Village. The Youkai Tanuki Forest houses all sorts of youkai and tanuki. Mamizou Futatsuiwa can be seen around there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "274": {
            "uid": 274,
            "key": [
                "Lake of Blood"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Lake of Blood is a lake in the mountains that appears to be filled with pure blood, rather than water. Within it lies the entrance to Mugenkan. Kurumi is the gatekeeper of the entrance to the lake. Elly stands guard within the lake, at the border between Gensokyo and the Fantasy World, protecting the entrance to Mugenkan.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "275": {
            "uid": 275,
            "key": [
                "Lyrica"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Lyrica Prismriver is a poltergeist keyboardist and the third Prismriver sister. Her music enhances the effect of Merlin's and Lunasa's. She lazy and crafty. Lyrica has brown eyes and short light brown hair. Her red keyboard is always nearby. She wears red clothing dress with pink and black trimming over a white shirt, red shorts, and a red hat with a green star decoration. She's the shortest Prismriver sister.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "276": {
            "uid": 276,
            "key": [
                "Mai",
                "Teireida"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mai Teireida is an immortal human. Mai can increase a person's physical energy by dancing behind them. She lives in the Land of the Backdoor, working for Okina with her partner Satono. Mai is scatterbrained and impulsive but serves Okina unquestioningly. She has short dull green hair with two long side locks, and green eyes. Mai wears a kazaori-eboshi, a green dress with short sleeves, a white half apron and collar with red frills and a yellow bow, black kneesocks, and green shoes. She holds a bamboo stalk.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "277": {
            "uid": 277,
            "key": [
                "Land of the Back Door"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Land of the Back Door is a dimension ruled and created by Okina. It's filled with floating doors that can lead to any location in Gensokyo. Satono and Mai live there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "278": {
            "uid": 278,
            "key": [
                "Nameless Hill"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Nameless Hill is located on the opposite side of the Youkai Mountain and halfway up a small mountain. It is a meadow filled with purple and white lilies-of-the-valley which are poisonous. Medicine Melancholy lives there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "279": {
            "uid": 279,
            "key": [
                "Outside World",
                "Earth",
                "Japan"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Outside World is modern-day Earth, which is separate from Gensokyo. It is technologically advanced but lacks faith and belief. Gensokyo is closest in culture to old Japan.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "280": {
            "uid": 280,
            "key": [
                "Nuclear Furnace"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Nuclear Furnace is located in the deepest parts of the Underworld. It creates nuclear fusion energy for power and heat. Kanako and Suwako built the Nuclear Furnace. Utsuho powers it.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "281": {
            "uid": 281,
            "key": [
                "Underground Geyser Center"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Underground Geyser Center is a research facility and located in the deepest parts of the Underworld. It is connected to the Nuclear Furnace. Kappa and the gods of the Moriya Shrine use it for research.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "282": {
            "uid": 282,
            "key": [
                "Shining Needle Castle"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Shining Needle Castle is located in the sky near Youkai Mountain. It was created by the Miracle Mallet a long time ago. It is the home to Shinmyoumaru and other inchlings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "283": {
            "uid": 283,
            "key": [
                "Eientei"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Eientei is a traditional Japanese mansion located in the Bamboo Forest. Its corridors sprawl endlessly. Kaguya is its mistress. It includes a clinic where Eirin works. It is home to Reisen & Tewi.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "284": {
            "uid": 284,
            "key": [
                "Kyouko",
                "Kasodani"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Kyouko Kasodani is a yamabiko. She can reflect sounds. She is a Buddhist priestess-in-training at the Myouren Temple and in a band with Mystia. Kyouko is cheerful, dutiful, and energetic but has a bit of a rebellious streak. She has teal hair and teal eyes along with brown dog ears. Kyouko wears a long pale pink dress with teal flower ornaments, a white dress under it with a black trim, and black shoes. She has a short tail and carries a bamboo broom.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "285": {
            "uid": 285,
            "key": [
                "Myouren Temple",
                "Palanquin Ship"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Myouren Temple was originally a ship. It rests atop the Hall of Dream's Great Mausoleum and has been turned in a Buddhist Temple. It is also called the \"Palanquin Ship.\" Byakuren can make it fly. This is the home of Byakuren, Shou, Nazrin, Ichirin, Murasa, Nue, Kyouko and Mamizou. Koishi and Jo'on can be found here occasionally.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "286": {
            "uid": 286,
            "key": [
                "Marisa",
                "Kirisame"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Marisa Kirisame is a human witch. She uses heat and light magic and receives power from the mini-hakkero. She lives in the Kirisame household in the Forest of Magic. Marisa enjoys finding mushrooms and stealing things she finds interesting. She is outgoing, informal, and loves action. Marisa is friends with Nitori, Alice and Patchouli. Reimu is Marisa's best friend. Marisa's signature attack is \"Master Spark\". Marisa has blonde hair and yellow eyes. She wears a black vest and skirt, white apron and shirt. Marisa has a black witch hat with white ribbons, and flies on a magic broom.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "287": {
            "uid": 287,
            "key": [
                "Genbu Ravine"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Genbu Ravine is located near Youkai Mountain and Forest of Magic. The bottom looks like turtleshell. It's surrounded by six-sided cliffs, and a waterfall drops into a lake at the bottom. Nitori lives near the Ravine.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "288": {
            "uid": 288,
            "key": [
                "Animal Realm"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Animal Realm is a skyscraper-filled metropolis located in Hell, with a forest known as the Primate Spirit Garden. The Animal Realm is filled with animal spirits and is a harsh environment relying on survival of the fittest. The animal spirits rule, and enslave human spirits. Notable leaders are Yachie and Saki.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "289": {
            "uid": 289,
            "key": [
                "Gensokyo",
                "Gensoukyo",
                "Eastern Wonderland",
                "Land of Illusions",
                "Land of Fantasy"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Gensokyo is a place located somewhere around the Yatsugatake Mountains in Japan. It's a land of illusions: it is hidden from the Outside World, and surrounded by the Great Hakurei Barrier. Gensokyo's inhabitants are mainly creatures of Japanese Folklore and humans. Gensokyo is surrounded by Great Hakurei Barrier. Everyone speaks Modern Japanese. The technology in Gensokyo is similar to 1880s-era Japan.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "290": {
            "uid": 290,
            "key": [
                "Hall of Dreams",
                "Great Mausoleum"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Hall of Dreams' Great Mausoleum is located under the Myouren Temple and is entered through a cave. It was the tomb of Toyosatomimi no Miko where she was sealed by Buddhist monks, but now serves as her home for her and her followers.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "291": {
            "uid": 291,
            "key": [
                "Rod of Remorse"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Rods of Remorse are carried by every Yama. It is used to beat sinners until they repent.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "292": {
            "uid": 292,
            "key": [
                "Eiki",
                "Shiki",
                "Shikieiki",
                "Yama",
                "Enma"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Eiki Shiki is a Yama living in Higan. Eiki is the Judge of the Dead for the Ministry of Right and Wrong. She has power to judge others using the Rod of Remorse and the Cleansed Crystal Mirror. Yuyuko is Eiki's subordinate. Eiki often scolds her servant Komachi. Eiki serves Hecatia. She is known to scold and lecture others, but does so with goodwill. Eiki has short green hair swept to the right and blue eyes. She wears a blue and white hat with a gold emblem, a blue and black uniform, and black shoes with red bows.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "293": {
            "uid": 293,
            "key": [
                "Enma",
                "Ministry of Right and Wrong"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Ministry of Right and Wrong is the organization that manages the afterlife. They decide who goes to Heaven or Hell. Hecatia Lapislazuli is the leader of Ministry. Eiki judges the souls of those who died and the Kishin hunt those who live too long.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "294": {
            "uid": 294,
            "key": [
                "Iku",
                "Nagae"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Iku Nagae is an oarfish youkai. Iku has the power to read the mood of a place and perfectly adapt to it. She can cause storms using the Dragon God's power. Iku is the envoy of the Dragon Palace and lives in Heaven. She is loyal to celestials and Dragon Palace residents, and is Tenshi's friend. Iku is focused on her duties and is rather calm and businesslike. Iku has red eyes and blue hair. She wears a white and red frilly shirt, a long black skirt, and a black round hat with a very long red ribbon. Iku has a long white and red shawl along her arms and chest. ",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "295": {
            "uid": 295,
            "key": [
                "Nazrin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Nazrin is a mouse youkai. She can find anything she is tasked to look for. She lives in a shack on the Nameless Hill and leads a large flock of mice. Nazrin a skilled dowser, but is full of herself and easily frightened. She was sent by Bishamonten to watch over Shou and her Pagoda. Nazrin has short gray hair and red eyes, mouse ears and a thick mouse tail. She wears a black sleeveless dress with rectangular cutouts at the bottom, a white undershirt and a dull blue capelet. Nazrin wears black slippers, a crystal pendant, and carries two dowsing rods.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "296": {
            "uid": 296,
            "key": [
                "Deep Road to Hell"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Deep Road to Hell leads to Former Hell. It's green and gloomy. Parsee roams around here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "297": {
            "uid": 297,
            "key": [
                "Fantastic Blowhole"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Fantastic Blowhole is a location in the Underworld near the Deep Road to Hell. It's a cave that is always wet with a very strong wind. Kisume and Yamame live there.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "298": {
            "uid": 298,
            "key": [
                "Chang'e"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Chang'e is a lunarian who was the mistress of all moon rabbits. She is now a prisoner on the moon for her entire immortal lifetime after drinking the Hourai Elixir. Junko has a major grudge against Chang'e for killing Junko's son. Hecatia Lapislazuli has a grudge against Chang'e since Chang'e's husband destroyed the suns that balanced the darkness of Hell.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "299": {
            "uid": 299,
            "key": [
                "Hot Spring Town"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hot Spring Town is a resort in Former Hell. It is accessible from the Rainbow Cavern of Earth Spirits, and managed by Yuugi. Hot Spring Town has densely packed traditional Japanese houses. Hot steamy water constantly pours from up above. There are large hot springs everywhere, which oni and vengeful spirits use to bathe.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "300": {
            "uid": 300,
            "key": [
                "Sanae",
                "Kochiya"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sanae Kochiya is a shrine maiden. She can perform miracles and can summon Suwako or Kanako. Sanae is confident, energetic, and dutiful. She considers Reimu her rival, but also a friend. Sanae lives at and tends to the Moriya shrine. She has green eyes, and long green hair. Sanae wears a white and blue shrine maiden outfit with detached sleeves. She has a frog pin, and a long white snake decoration in her hair. Sanae also wears white kneesocks and black loafers. She is a descendant of Suwako.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "301": {
            "uid": 301,
            "key": [
                "Aya",
                "Shameimaru",
                "Bunbunmaru"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Aya Shameimaru is a crow tengu reporter. She has power to manipulate wind. Aya is one of the strongest tengu, and one of the fastest. Aya lives somewhere on Youkai Mountain. She always looks for gossip, relying on aggressive reporting tactics and is prone to exaggerate. While Aya actually cares about the truth, she is somewhat full of herself. Aya runs a newspaper called the Bunbunmaru. She is Hatate's rival. Aya has red eyes and shoulder-length black hair. She wears a white blouse with a black ribbon, black skirt, red geta sandals and a red tokin. She usually carries a camera.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "302": {
            "uid": 302,
            "key": [
                "Bake-danuki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Bake-danuki are youkai tanuki. They have the ability to transform and disguise themselves as objects or other species. Bake-danuki can also transform leaves into other objects.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "303": {
            "uid": 303,
            "key": [
                "Hakutaku",
                "Were-Hakutaku"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Were-hakutaku are humans with the ability to turn into a hakutaku on a full moon. Hakutaku are bovine youkai who bring good fortune and give sage advice.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "304": {
            "uid": 304,
            "key": [
                "Hakurouken"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hakurouken is an ancestral wakizashi of the Konpaku family. Only Konpaku family members can wield it. Youmu owns it. It erases doubt from humans on attack. Ghosts achieve nirvana when cut by Hakurouken.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "305": {
            "uid": 305,
            "key": [
                "Jiang Shi",
                "Jiangshi",
                "Zombie"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Jiang shi are zombie youkai that move by hopping around and can turn other humans into Jiang Shi by biting them. The zombification will only be permanent if the bite is fatal. They have stiff limbs and cannot think for themselves, usually following a master.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "306": {
            "uid": 306,
            "key": [
                "Barrier of Life and Death"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Barrier of Life and Death is located in the sky and separates Gensokyo and the Netherworld. It takes the shape of a colossal door.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "307": {
            "uid": 307,
            "key": [
                "Spring Path"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Spring Path is a long mysterious path full of flowers and cherry blossom located near Misty Lake and the Forest of Magic.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "308": {
            "uid": 308,
            "key": [
                "Chiyuri",
                "Kitashirakawa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Chiyuri Kitashirakawa is a human not native to Gensokyo. She can use artificial magic, is a bit excitable, and will often make situations much worse than they already are. Chiyuri has blonde hair and yellow eyes. She wears a white sailor uniform with a shade of blue which looks too small for her and a blue neckerchief. Chiyuri commands the Probability Space Hypervessel. She assists Yumemi Okazaki.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "309": {
            "uid": 309,
            "key": [
                "Former Hell"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Former Hell is a region in the Underworld that used to be Hell. Due to overpopulation, the Yama moved Hell to a different location. It is accessed by the Deep Road to Hell, guarded by Parsee. The Palace of the Earth Spirits is found here. This place is the home of Yuugi, Satori, Koishi, Utsuho, and Rin.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "310": {
            "uid": 310,
            "key": [
                "Hisoutensoku"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Hisoutensoku is a nuclear powered mecha created by the kappa. It resembles a giant golden robot. It is used for advertising the Future Water Youkai Bazaar, but is often confused for all sorts of monsters.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "311": {
            "uid": 311,
            "key": [
                "Road of Liminality"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Road of Liminality is located at the back of the Youkai Mountain and is connected to the Sanzu River. Harmless ghosts roam around, and both youkai and humans built stands to sell their wares here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "312": {
            "uid": 312,
            "key": [
                "Primate Spirit Garden"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Primate Spirit Garden is a large park resembling a kofun burial mound, located in the Animal Realm. Part of it was transformed into a high-tech fortress by Keiki Haniyasushin. The animal spirits are trying to take back this region but are unable to defeat the Haniwa Army Corps defending it. Keiki and Mayumi live here.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "313": {
            "uid": 313,
            "key": [
                "Jeweled Pagoda"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Jeweled Pagoda of Bishamonten is a spherical gem held in a pagoda-shaped case. It is owned and used by Shou. It can fire powerful laser beams. If shot at the ground, it will turn it into gems.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "314": {
            "uid": 314,
            "key": [
                "Great Youkai Forest"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Great Youkai Forest is located at the base of the Youkai Mountain. It's a forest known to block out sunlight allowing most youkai to live there in peace.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "315": {
            "uid": 315,
            "key": [
                "Matenshi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Matenshi is an angel residing in Makai. She has purple hair at medium length and purple eyes. Matenshi wears a blue dress with a blue apron that has a white cross design on it. She also has angel-like wings. She is known to be hostile to humans.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "316": {
            "uid": 316,
            "key": [
                "Prismriver Sisters",
                "Prismriver"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Prismriver Sisters are Lunasa, Merlin and Lyrica. They form \"the Phantom Ensemble\". The Prismriver Sisters play concerts throughout Gensokyo. They live in the Ruined Western Mansion with Layla.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "317": {
            "uid": 317,
            "key": [
                "Saigyou Ayakashi",
                "Hakugyokurou"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Saigyou Ayakashi is a youkai cherry tree living in Hakugyokurou. The Saigyou Ayakashi has a lot of dead bodies buried under it to seal its cherry blossoms. It drains life from those under its canopy. If it blooms, it will cause mass death.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "318": {
            "uid": 318,
            "key": [
                "Roukanken"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Roukanken is a long-bladed katana created by youkai and wielded by Youmu Konpaku. Youmu likes to boast about the power of this sword, usually exclaiming \"The things that cannot be cut by my Roukanken, forged by youkai, are close to none!\". Supposedly, it can kill ten spirits with one stroke. The sheath is decorated with a flower and ofuda.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "319": {
            "uid": 319,
            "key": [
                "Soul Torch"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Soul Torch is a small paper lantern which attracts phantoms when lit. It is used by Yuyuko Saigyouji. She can light or extinguish the torch from any distance.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "320": {
            "uid": 320,
            "key": [
                "Miracle Mallet"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Miracle Mallet is a magical tool wielded by Shinmyoumaru. The Miracle Mallet can change the size of anything with its powers or grant the wielder's wish at the cost proportional to the scale of the wish. The Miracle Mallet can only be wielded by the inchlings.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "321": {
            "uid": 321,
            "key": [
                "Sword of Hisou"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Sword of Hisou looks like a burning-red jian. It is wielded by Tenshi Hinanawi. It has the power to identify one's spirit, can cut through anything and use spirit energy. It can only be used and summoned by Tenshi.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "322": {
            "uid": 322,
            "key": [
                "Sagume",
                "Kishin"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sagume Kishin is a lunarian divine spirit. Her ability reverses the course of any situation she speaks about. She speaks very little because of her ability, but is sharp and logical. Sagume has red eyes, short light grey hair with a princess braid around her head and a single angel wing on her back. She wears a purple dress whose bottom cuts off in an arrow pattern, a red microphone bowtie, a tan jacket with black alchemical symbols, and brown shoes.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "323": {
            "uid": 323,
            "key": [
                "Watatsuki no Toyohime",
                "Toyohime",
                "Watatsuki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Watatsuki no Toyohime is a lunarian princess and older sister of Yorihime. Toyohime possesses incommensurate luck, power, and can manipulate the physical and conceptual boundaries of the Moon and Earth, as well as mountains and seas. Toyohime has a gentle personality but is rather aloof. Udongein was her pet and Rei'sen is her current pet. Toyohime respects Eirin as her former teacher. She has long flowing blonde hair and golden eyes. Toyohime wears a white long-sleeved blouse with a blue dress over it, a loose belt, short purple boots and a white mobcap with a purple ribbon. She wields a fan that can purify things to the atomic level.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "324": {
            "uid": 324,
            "key": [
                "Unzan"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Unzan is a nyuudou or enlightened spirit who follows and guards Ichirin. He can make his fists grow to a massive size or shoot danmaku. Unzan takes the appearance of a pinkish cloud with the face of an angry old man, but he is quite shy and prefers that Ichirin speak on his behalf. Even then, he gives her insight when needed.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "325": {
            "uid": 325,
            "key": [
                "Grassroots Youkai"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Grassroots Youkai Network is a loose group of weaker and more docile youkai. They help each other and trade information.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "326": {
            "uid": 326,
            "key": [
                "Mike",
                "Goutokuji"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mike Goutokuji is a female calico Maneki-Neko. She has the power to bring either money or customers to a shop, but not both at once. She lives near Youkai Mountain. Mike loves haggling but prefers lazing around. She was rejected by other Maneki-Neko because she is a calico. Mike has short brown-orange-white hair, a cat tail and cat ears, and orange eyes. She wears a white shirt and skirt with brown and orange patches, leather bracelets and a choker with a gold bell. Mike carries a good luck koban coin and is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "327": {
            "uid": 327,
            "key": [
                "Maneki-neko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Maneki-nekos are catpeople that bring good fortune to businesses. They are usually pure white but exceptions exist and are often rejected by the others.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "328": {
            "uid": 328,
            "key": [
                "Yamawaro"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yamawaro are similar to Kappa but live in mountainous areas and thick forests rather than near bodies of water. They are rivals with Kappas. Yamawaros depend on Kappa technology but are better businesspeople.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "329": {
            "uid": 329,
            "key": [
                "Takane",
                "Yamashiro"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Takane Yamashiro is a yamawaro living in the Youkai Mountain's forests. She has the ability to manipulate the Qi of the forest. Takane is more amiable than average yamawaro, and a good businesswoman. She is wary of humans but manages the Moriya Shrine cable car. Takane has fluffy shoulder-length green hair and dark green eyes. She wears a dark green camouflage dress with many pouches, a dark blue camo cap and brown boots. Takane carries a briefcase on her back with the key around her neck.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "330": {
            "uid": 330,
            "key": [
                "Sannyo",
                "Komakusa"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Sannyo Komakusa or Komakusa-dayuu is a yamajorou. She can manipulate minds with her pipe's smoke. Sannyo owns a gambling den on the Youkai Mountain. She is blunt and rough-spoken and a skilled manipulator. Sannyo has purple hair in a ponytail tied with a yellow bow, and red eyes. Sannyo wears a lavish purple kimono dress, a red vest with gold filigree and geta sandals. She carries a golden fan and a dragon-shaped smoking pipe.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "331": {
            "uid": 331,
            "key": [
                "Misumaru",
                "Tamatsukuri"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Misumaru Tamatsukuri is a god. She can craft magatama from dragon gems and rare magical minerals. Her power lets her store abilities, emotions and memories in magatama. She crafted Reimu's Yin-yang orbs. Misumaru cares deeply about people and the environment. Misumaru has brown eyes and blonde and brown hair with a headband and hair ties decorated with dragon gems. She wears a red shirt with a purple vine pattern and white puffy sleeves, a yellow dress with a green vine pattern and a purple sash. Misumaru's clothing is decorated with many rainbow magatama. She is barefoot.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "332": {
            "uid": 332,
            "key": [
                "Tsukasa",
                "Kudamaki"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tsukasa Kudamaki is a kuda-gitsune. She can use her power to find weak spots in people's souls. Tsukasa is trusted by many for her useful advice but is highly manipulative and mean-spirited. She is Megumu's right-hand woman. She has neck-length blonde hair,yellow eyes, blonde fox ears with white tips and a fox tail. Tsukasa wears a short white cheongsam with mint green laces and a plant design, white tabi socks and carries a test tube around.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "333": {
            "uid": 333,
            "key": [
                "Megumu",
                "Iizunamaru"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Megumu Iizunamaru is a great tengu. She can manipulate the starry sky. She is one of the leaders of Youkai Mountain's tengu. She speaks respectfully but cares only for her position in the tengu hierarchy. Tsukasa and Chimata are her associates. Megumu has dark blue hair and red eyes. She wears a blue dress, a black coat with a jeweled gold pauldron and white puffs at the bottom, a blue tokin hat, black socks & purple geta sandals. She wields a camera tripod as a bludgeon.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "334": {
            "uid": 334,
            "key": [
                "Chimata",
                "Tenkyuu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Chimata Tenkyuu is a god of the marketplace. She can transfer the ownership of things from one person to another, including concepts or abilities. Chimata is polite but somewhat dramatic in her behavior, and very strung up on the rules of barter market. She hates profit-seekers, preferring those who wish to share the value of things. She is Megumu's and Tsukasa's associate. Her eyes and hair look like a dark sky. She wears a dress with sections of all colors of the rainbow connected by zippers, magenta boots and a cape whose inside looks like daytime sky.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "335": {
            "uid": 335,
            "key": [
                "Momoyo",
                "Himemushi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Momoyo Himemushi is an oomukade. Her ability lets her devour dragons. She lives in the Rainbow Dragon Cave and mines Dragon Gems. Momoyo is incomprehensibly strong and emits deadly toxins, and thus respects anyone who dares approach her. Momoyo speaks in a very masculine manner. She works for Megumu. Momoyo has very messy gray hair and eyes. She wears a black shirt and skirt with gold swirls lined with many jade rings. Momoyo has many orange ribbons tied around her arms and legs, an orange sash around her waist and is barefoot. She carries a golden shovel and pickaxe.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "336": {
            "uid": 336,
            "key": [
                "Tokiko"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Tokiko is a crested ibis youkai. She is weak and has no special abilities. Tokiko is curious and loves to read, often visiting places with large amounts of books. She has white hair with a blue front tuft and side bangs, small pointy blue horns, and red eyes. She wears a blue and black gothic dress with wide white sleeves, a large blue ribbon and black boots.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "337": {
            "uid": 337,
            "key": [
                "Child of Miare",
                "Akyuu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Child of Miare is the reincarnation of Hieda no Are and the keeper of Gensokyo's knowledge. They live for a very short time but keep memories of their previous lives and are unable to forget things they see.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "338": {
            "uid": 338,
            "key": [
                "Toutetsu",
                "Yuuma"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yuuma Toutetsu is a Taotie. She has the ability to swallow anything and absorb it, and can also \"eat\" attacks. Yuuma is the head of the Gouyoku Alliance, and a rival of Saki and Yachie. Yuuma lives in the Animal Realm and visits the Sea of Petroleum and Abandoned Hell of Blood Pools for power. Yuuma is greedy and opportunistic. Yuuma has fluffy white hair like wool, and slitted red sheep eyes. She has long, pointy ears with gold earrings, and big red ram horns decorated with blue ribbons. Yuuma wears a blue dress with white patterns similar to Chinese bronzework and short red sleeves with exposed shoulders, a bronze talisman around her neck, and is barefoot. Yuuma carries a massive spoon she uses as a weapon.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "339": {
            "uid": 339,
            "key": [
                "Gouyoku"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Gouyoku Alliance is an organization in the Animal Realm led by Yuuma Toutetsu and a rival to Yachie and Saki's organizations. They represent greed.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "340": {
            "uid": 340,
            "key": [
                "Sea of Petroleum"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Sea of Petroleum is a location in Hell which is filled with oil. It connects to the Abandoned Hell of Blood Pools. Yuuma Toutetsu frequents it to acquire power.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "341": {
            "uid": 341,
            "key": [
                "Abandoned Hell of Blood Pools"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Abandoned Hell of Blood Pools is a former Hell that contains pools that represents different sins. Yuuma Toutetsu uses these pools to power herself up.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "342": {
            "uid": 342,
            "key": [
                "Taotie"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "A Taotie is a type of evil beast in Chinese mythology. They have sheeplike features and are creatures of corruption and greed.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "343": {
            "uid": 343,
            "key": [
                "Rainbow Cavern"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Rainbow Cavern of Earth Spirits is an underground passage located in the Forest of Magic, leading to the Hot Spring Town in Former Hell. Yamame sometimes lurks around.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "344": {
            "uid": 344,
            "key": [
                "Sages",
                "Sages of Gensokyo"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Yukari, Okina and Kasen are the currently known sages of Gensokyo, and help maintain the Great Hakurei Barrier.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "345": {
            "uid": 345,
            "key": [
                "Sutra Scroll"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Sorcerer's Sutra Scroll is an infinite scroll that only Hijiri Byakuren can wield. It contains an unlimited amount of spells and does not deteriorate. It can cast spells on its own, or enhance Hijiri's.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "346": {
            "uid": 346,
            "key": [
                "Omukade"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Omukade are youkai giant centipedes. Oomukade live under mountains and reach colossal sizes. They are rumored to be dragon-eaters and are assumed to be tremendously strong as a result.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "347": {
            "uid": 347,
            "key": [
                "Shining Needle Sword"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Shining Needle Sword is a magical needle used by Shinmyoumaru. It can fire beams from its tip and acts as a focus for her magic.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "348": {
            "uid": 348,
            "key": [
                "Keiga"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Keiga Family is an organization in the Animal Realm led by Saki Kurokoma and a rival to Yachie and Yuuma's organizations. They represent brute force.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "349": {
            "uid": 349,
            "key": [
                "Kiketsu"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Kiketsu Family is an organization in the Animal Realm led by Yachie Kicchou and a rival to Saki and Yuuma's organizations. They represent conniving and conspiring.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        },
        "350": {
            "uid": 350,
            "key": [
                "Mizuchi",
                "Miyadeguchi"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Mizuchi Miyadeguchi is a vengeful spirit. She can possess anyone regardless of strength. Mizuchi lives in Hell but roams Gensokyo in search of victims. She collects magical trinkets, and stalks Reimu to cause her trouble. Mizuchi has dark blue eyes and dark blue hair that fades to deep green in a ponytail, with two short braids to the sides and hairpins shaped like bundles of little ghosts. Mizuchi wears a black and white striped shirt and skirt over a short black dress. Mizuchi's legs stop at the thighs and dissipate into bluish mist. Her gloves have handcuffs with broken chains. Mizuchi has a very large handcuff around her neck, and uses the opposite cuff to catch possession victims.",
            "constant": false,
            "selective": false,
            "order": 100,
            "position": 0
        }
    },
    "is_creation": false
}